{
  "conditionsForSearch": [
    {
      "type": {
        "vi": "Header",
        "en": "Header"
      },
      "items": [
        {
          "key": {
            "data": "exchangeName",
            "lang": {
              "vi": "Sàn",
              "en": "Exchange"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "HOSE",
              "lang": {
                "vi": "HOSE",
                "en": "HOSE"
              }
            },
            {
              "data": "HNX",
              "lang": {
                "vi": "HNX",
                "en": "HNX"
              }
            },
            {
              "data": "UPCOM",
              "lang": {
                "vi": "UPCOM",
                "en": "UPCOM"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Mã cổ phiếu theo sàn",
            "en": "Ticker by exchange"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "fundamental",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "industryName",
            "lang": {
              "vi": "Ngành",
              "en": "Industry"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "Retail",
              "lang": {
                "vi": "Bán lẻ",
                "en": "Retail"
              }
            },
            {
              "data": "Insurance",
              "lang": {
                "vi": "Bảo hiểm",
                "en": "Insurance"
              }
            },
            {
              "data": "Real Estate",
              "lang": {
                "vi": "Bất động sản",
                "en": "Real Estate"
              }
            },
            {
              "data": "Technology",
              "lang": {
                "vi": "Công nghệ Thông tin",
                "en": "Technology"
              }
            },
            {
              "data": "Oil & Gas",
              "lang": {
                "vi": "Dầu khí",
                "en": "Oil & Gas"
              }
            },
            {
              "data": "Financial Services",
              "lang": {
                "vi": "Dịch vụ tài chính",
                "en": "Financial Services"
              }
            },
            {
              "data": "Utilities",
              "lang": {
                "vi": "Điện, nước & xăng dầu khí đốt",
                "en": "Utilities"
              }
            },
            {
              "data": "Travel & Leisure",
              "lang": {
                "vi": "Du lịch và Giải trí",
                "en": "Travel & Leisure"
              }
            },
            {
              "data": "Industrial Goods & Services",
              "lang": {
                "vi": "Hàng & Dịch vụ Công nghiệp",
                "en": "Industrial Goods & Services"
              }
            },
            {
              "data": "Personal & Household Goods",
              "lang": {
                "vi": "Hàng cá nhân & Gia dụng",
                "en": "Personal & Household Goods"
              }
            },
            {
              "data": "Chemicals",
              "lang": {
                "vi": "Hóa chất",
                "en": "Chemicals"
              }
            },
            {
              "data": "Banks",
              "lang": {
                "vi": "Ngân hàng",
                "en": "Banks"
              }
            },
            {
              "data": "Automobiles & Parts",
              "lang": {
                "vi": "Ô tô và phụ tùng",
                "en": "Automobiles & Parts"
              }
            },
            {
              "data": "Basic Resources",
              "lang": {
                "vi": "Tài nguyên Cơ bản",
                "en": "Basic Resources"
              }
            },
            {
              "data": "Food & Beverage",
              "lang": {
                "vi": "Thực phẩm và đồ uống",
                "en": "Food & Beverage"
              }
            },
            {
              "data": "Media",
              "lang": {
                "vi": "Truyền thông",
                "en": "Media"
              }
            },
            {
              "data": "Telecommunications",
              "lang": {
                "vi": "Viễn thông",
                "en": "Telecommunications"
              }
            },
            {
              "data": "Construction & Materials",
              "lang": {
                "vi": "Xây dựng và Vật liệu",
                "en": "Construction & Materials"
              }
            },
            {
              "data": "Health Care",
              "lang": {
                "vi": "Y tế",
                "en": "Health Care"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Tiêu chí lọc cổ phiếu theo ngành nghề hoạt động của công ty",
            "en": "Find tickers which belong to a specific sector"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "fundamental",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "hasFinancialReport",
            "lang": {
              "vi": "Có BCTC quý gần nhất",
              "en": "Has Financial Report"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "0",
              "lang": {
                "vi": "Không",
                "en": "No"
              }
            },
            {
              "data": "1",
              "lang": {
                "vi": "Có",
                "en": "Yes"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "",
            "en": ""
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "none"
        }
      ]
    },
    {
      "type": {
        "vi": "Thông tin chung",
        "en": "General"
      },
      "items": [
        {
          "key": {
            "data": "marketCap",
            "lang": {
              "vi": "Vốn hoá",
              "en": "Market Cap"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Tiêu chí lọc cổ phiếu theo quy mô vốn hóa của công ty",
            "en": "Find tickers whose market capitalization meet specific criteria"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "priceNearRealtime",
            "lang": {
              "vi": "Thị giá",
              "en": "Price"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "thousand",
            "lang": {
              "vi": "nghìn",
              "en": "thousand"
            }
          },
          "tooltip": {
            "vi": "Nhà đầu tư có thể sử dụng tiêu chí này để tìm kiếm những cổ phiếu giao dịch ở một vùng giá nhất định. Những nhà đầu tư có quy mô tài sản ròng (NAV) nhỏ có thể tìm kiếm cơ hội đầu tư ở những cổ phiếu với thị giá thấp.",
            "en": "Investors can use this filter to look for stocks that trade within a certain price range. Investors with limited net asset value (NAV) can discover opportunities at lower price ranges."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "foreignVolumePercent",
            "lang": {
              "vi": "% Sở hữu NN",
              "en": "% Foreign ownership"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là tiêu chí lọc cổ phiếu theo tỷ lệ phần trăm sở hữu của nhà đầu tư nước ngoài. <br>Để hạn chế rủi ro, nhà đầu tư nước ngoài thường có xu hướng đòi hỏi sự minh bạch cao và tìm hiểu kỹ về sức khỏe doanh nghiệp, triển vọng kinh doanh. Do vậy, việc tìm kiếm những doanh nghiệp có tỷ lệ sở hữu nước ngoài cao cũng là một sự lựa chọn cho nhà đầu tư.",
            "en": "This filter indicates the percentage of foreign ownership in a company. <br>In order to limit risks, foreign investors tend to demand a high level of transparency and do thorough research on the company's financial health and business prospects. Therefore, looking for companies with a high percentage of foreign ownership can be an investment strategy."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0LOE100",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "alpha",
            "lang": {
              "vi": "Alpha",
              "en": "Alpha"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Theo mô hình CAPM, tỷ suất sinh lời của một cổ phiếu sẽ được tính như sau: Tỷ suất sinh lời cổ phiếu = Alpha + Beta * Tỷ suất sinh lời của danh mục thị trường. <br>Trong đó: Danh mục thị trường (Market Portfolio) là danh mục đại diện cho các kênh đầu tư cổ phiếu, được đa dạng hóa và chỉ có rủi ro hệ thống. Ở Việt Nam, danh mục đầu tư thị trường thường là VN-Index. <br>Như vậy, tỷ suất sinh lời cổ phiếu có thể tách làm 2 phần: <br>+ Alpha: là phần tỷ suất sinh lời của riêng cổ phiếu đó, không phụ thuộc vào thị trường chung (rủi ro hệ thống). <br>+ (Beta * Tỷ suất sinh lời của danh mục thị trường): là phần tỷ suất sinh lời của cổ phiếu có tính đến biến động chung của thị trường (rủi ro hệ thống). <br>Theo đó, alpha càng lớn thì tỷ suất sinh lời của riêng cổ phiếu/danh mục càng cao, cổ phiếu/danh mục đó càng ít phụ thuộc vào biến động chung của thị trường (VN-Index).",
            "en": "According to the CAPM, the formula for a stock's rate of return (RoR) is: <br>RoR = Alpha + Beta * Market Portfolio's RoR <br>A market portfolio comprises of various investment channels. By nature, a market portfolio is diversified and exposed to only systematic risk. The general consensus of a market portfolio in Vietnam is the VN-Index. <br>A stock's rate of return can be categorized into 2 components: <br>+ Alpha: a stock's own rate of return and unaffected by the systematic risk of the market <br>+ Beta * Market Portfolio's rate of return: a stock's rate of return that has accounted for systematic risk <br>Accordingly, the greater the alpha value that a stock/portfolio carries, the higher the rate of return of a stock/portfolio and the less reliant a stock/portfolio is on the overall market volatility of VN-Index."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "beta",
            "lang": {
              "vi": "Beta",
              "en": "Beta"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Beta là hệ số đo lường mức độ biến động của giá cổ phiếu/giá trị danh mục so với giá trị danh mục thị trường. Trong đó: Danh mục thị trường (Market Portfolio) là danh mục đại diện cho các kênh đầu tư cổ phiếu, được đa dạng hóa và chỉ có rủi ro hệ thống. Ở Việt Nam, danh mục đầu tư thị trường thường là VN-Index. Theo định nghĩa này, Beta của danh mục đầu tư thị trường là 1.0. <br>Beta của cổ phiếu/danh mục ở các mức giá trị khác nhau sẽ mang những ý nghĩa khác nhau, cụ thể: <br>+ Giá trị tuyệt đối của Beta thể hiện mức độ biến động. Ví dụ: Giá trị tuyệt đối của Beta > 1 thể hiện giá cổ phiếu/danh mục biến động nhiều hơn, giá trị tuyệt đối của Beta < 1 thể hiện giá cổ phiếu/danh mục biến động ít hơn so với thị trường. <br>+ Beta > 0 thể hiện giá cổ phiếu/danh mục biến động cùng chiều với thị trường, Beta < 0 thể hiện giá cổ phiếu/danh mục biến động ngược chiều với thị trường. <br>Như vậy, giả sử Beta của cố phiếu có giá trị là 1.5 có nghĩa là cổ phiếu có mức độ biến động cùng chiều và lớn hơn thị trường chung (VN-Index).",
            "en": "Beta is a coefficient that measures a stock's price volatility relative to the value of a market portfolio. A market portfolio comprises of various investment channels. By nature, a market portfolio is diversified and exposed to only systematic risk. The general consensus of a market portfolio in Vietnam is the VN-Index, while the default Beta of a market portfolio is set at 1.0. <br>A Beta coefficient of a stock/portfolio at different values carry different meanings. Specifically: <br>+ The absolute value of Beta represents the level of volatility. For example, an absolute value of Beta > 1 signifies high volatility in a stock's price, while an absolute value of Beta < 1 indicates less volatility in a stock's price relative to the market. <br>+ A Beta value > 0 shows a stock price/portfolio’s volatility is aligned with the trend of the market, while a Beta value < 0 signals that the stock price/portfolio’s volatility is moving in the opposite direction relative to the market. <br>For example, if a stock has a Beta coefficient of 1.5, this particular stock is aligned with the current direction of the market and is also more volatile than the overall market (VN-Index)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "freeTransferRate",
            "lang": {
              "vi": "Tỷ lệ chuyển nhượng tự do",
              "en": "Free-float"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là tỷ lệ cổ phiếu chuyển nhượng tự do (free-float) trên tổng số cổ phiếu đang lưu hành. Trong đó, cổ phiếu chuyển nhượng tự do là cổ phiếu được giao dịch công khai và không bị hạn chế, loại trừ: cổ phiếu thuộc sở hữu của cổ đông nội bộ, cổ đông chiến lược, cổ đông lớn,... Tỷ lệ free-float thấp cho thấy nguồn cung trên thị trường của cổ phiếu hạn chế. Khi cổ phiếu thu hút được lượng lớn nhà đầu tư, sự mất cân bằng cung - cầu sẽ giúp giá cổ phiếu tăng nhanh trong thời gian ngắn. Tuy nhiên, việc giao dịch với những cổ phiếu có tỷ lệ free-float thấp cũng tiềm ẩn nhiều rủi ro. Khi doanh nghiệp gặp những thông tin bất lợi, giá cổ phiếu có thể giảm mạnh trong thời gian ngắn.",
            "en": "This is the percentage of shares in a company that can be freely traded. More specifically, free-float refers to the shares that can be traded publicly under no limitations, which exclude shares owned by internal, strategic, large shareholders, etc. A low free-float ratio indicates that the stock's supply in the market is limited. When the stock attracts a large following of investors, the short-term supply - demand imbalance can cause the stock to spike up. However, investing in low free-float stocks might pose many risks as well. When the company faces difficulties, the stock can decrease sharply in a short time."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "corporatePercentage",
            "lang": {
              "vi": "Tỷ lệ sở hữu tổ chức",
              "en": "Institutional ownership ratio"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là tỷ lệ cổ phiếu được sở hữu bởi các nhà đầu tư tổ chức như quỹ đầu tư, quỹ hưu trí và công ty bảo hiểm. Tỷ lệ sở hữu tổ chức cao thường cho thấy các nhà đầu tư chuyên nghiệp có niềm tin vào triển vọng và ban lãnh đạo của công ty.",
            "en": "This is the percentage of shares owned by institutional investors such as mutual funds, pension funds, and insurance companies. A high institutional ownership ratio often indicates that professional investors have confidence in the company's prospects and management."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "ev",
            "lang": {
              "vi": "Giá trị doanh nghiệp (EV)",
              "en": "Enterprise value (EV)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Giá trị doanh nghiệp (EV) là thước đo tổng giá trị của một công ty, được tính bằng vốn hóa thị trường cộng với nợ, lợi ích cổ đông thiểu số và cổ phiếu ưu đãi, trừ đi tổng tiền mặt và các khoản tương đương tiền. EV được sử dụng trong các tỷ lệ định giá như EV/EBITDA và cung cấp cái nhìn toàn diện hơn về giá trị của công ty so với chỉ riêng vốn hóa thị trường.",
            "en": "Enterprise Value (EV) is a measure of a company's total value, calculated as market capitalization plus debt, minority interest and preferred shares, minus total cash and cash equivalents. EV is used in valuation ratios like EV/EBITDA and provides a more comprehensive view of a company's value than market cap alone."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        }
      ]
    },
    {
      "type": {
        "vi": "Tăng trưởng",
        "en": "Growth"
      },
      "items": [
        {
          "key": {
            "data": "revenueGrowth1Year",
            "lang": {
              "vi": "% DT 1 năm",
              "en": "1-year revenue growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng Doanh thu thuần năm gần nhất của công ty. Chỉ số này ở mức cao cho thấy hoạt động kinh doanh của công ty đang tăng trưởng tốt, công ty đang ăn nên làm ra. <br>Công ty có triển vọng tốt nếu tỷ lệ tăng trưởng doanh thu hàng năm trên 15%.",
            "en": "This is the revenue's growth rate in the most recent year. A high number indicates that the business is thriving and profitable. <br>The company has great potential if the annual revenue growth rate is greater than 15%."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "revenueGrowth5Year",
            "lang": {
              "vi": "% DT 5 năm",
              "en": "5-years revenue growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng Doanh thu thuần trung bình 5 năm của công ty. Chỉ số này ở mức cao cho thấy hoạt động kinh doanh của công ty đang tăng trưởng tốt, công ty đang ăn nên làm ra. Công ty có triển vọng tốt nếu tỷ lệ tăng trưởng doanh thu hàng năm trên 15%.",
            "en": "This is the revenue's growth rate in the most recent 5 years. A high number indicates that the business is thriving and profitable. The company has great potential if the annual revenue growth rate is greater than 15%."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "epsGrowth1Year",
            "lang": {
              "vi": "% EPS 1 năm",
              "en": "1-year EPS growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng EPS năm gần nhất của công ty. Chỉ số này có tính đến yếu tố thay đổi số lượng cổ phiếu, qua đó cung cấp một góc nhìn tốt hơn để đánh giá hiệu quả hoạt động của Công ty. Chỉ số này ở mức cao (trên 20%) cho thấy công ty đang hoạt động hiệu quả và tạo ra lợi nhuận. Những doanh nghiệp có mức tăng trưởng EPS ổn định ở mức cao luôn được các nhà đầu tư quan tâm.",
            "en": "This is the EPS growth rate in the most recent year. This rate accounts for changes in the number of shares to provide a better interpretation of the company's efficiency. A high number (greater than 20%) indicates that the company is efficient and profitable. Companies with high, steady EPS growth rates usually attract investors' interest."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "epsGrowth5Year",
            "lang": {
              "vi": "% EPS 5 năm",
              "en": "5-years EPS growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng EPS trung bình 5 năm của công ty. Chỉ số này có tính đến yếu tố thay đổi số lượng cổ phiếu, qua đó cung cấp một góc nhìn tốt hơn để đánh giá hiệu quả hoạt động của Công ty. Chỉ số này ở mức cao (trên 20%) cho thấy công ty đang hoạt động hiệu quả và tạo ra lợi nhuận. Những doanh nghiệp có mức tăng trưởng EPS ổn định ở mức cao luôn được các nhà đầu tư quan tâm.",
            "en": "This is the EPS growth rate in the most recent 5 years. This rate accounts for changes in the number of shares to provide a better interpretation of the company's efficiency. A high number (greater than 20%) indicates that the company is efficient and profitable. Companies with high, steady EPS growth rates usually attract investors' interest."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "lastQuarterRevenueGrowth",
            "lang": {
              "vi": "Tăng trưởng doanh thu quý gần nhất",
              "en": "Latest quarterly revenue growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng doanh thu thuần quý gần nhất của công ty. Chỉ số này ở mức cao cho thấy hoạt động kinh doanh của công ty đang tăng trưởng tốt, công ty đang ăn nên làm ra. Công ty có triển vọng tốt nếu tỷ lệ tăng trưởng doanh thu hàng quý trên 15%.",
            "en": "This is the revenue's growth rate in the most recent quarter. A high number indicates that the business is thriving and profitable. The company has great potential if the quarterly revenue growth rate is greater than 15%."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "secondQuarterRevenueGrowth",
            "lang": {
              "vi": "Tăng trưởng doanh thu quý gần nhì",
              "en": "Second latest quarterly revenue growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng doanh thu thuần quý gần nhì của công ty. Chỉ số này ở mức cao cho thấy hoạt động kinh doanh của công ty đang tăng trưởng tốt, công ty đang ăn nên làm ra. Công ty có triển vọng tốt nếu tỷ lệ tăng trưởng doanh thu hàng quý trên 15%. Việc doanh nghiệp duy trì đà tăng trưởng doanh thu trong 2 quý liên tiếp cho thấy sự tăng trưởng của doanh nghiệp mang yếu tố bền vững, xu hướng này có thể được duy trì trong những quý tiếp theo.",
            "en": "This is the revenue's growth rate in the second most recent quarter. A high number indicates that the business is thriving and profitable. The company has great potential if the quarterly revenue growth rate is greater than 15%. If a company maintains high revenue growth rates in the last two quarters, it indicates that the growth is sustainable and the trend might continue in the following quarters."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "lastQuarterProfitGrowth",
            "lang": {
              "vi": "Tăng trưởng lợi nhuận quý gần nhất",
              "en": "Latest quarterly profit growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng lợi nhuận quý gần nhất của công ty. Chỉ số này ở mức cao cho thấy hoạt động kinh doanh của công ty đang hiệu quả, tạo ra nhiều lợi nhuận hơn cùng kỳ, công ty đang ăn nên làm ra.",
            "en": "This is the profit's growth rate in the most recent quarter. A high number indicates that the business is thriving and profitable. The company has great potential if the quarterly profit growth rate is greater than 15%."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "secondQuarterProfitGrowth",
            "lang": {
              "vi": "Tăng trưởng lợi nhuận quý gần nhì",
              "en": "Second latest quarterly profit growth"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là mức tăng trưởng lợi nhuận quý gần nhì của công ty. Chỉ số này ở mức cao cho thấy hoạt động kinh doanh của công ty đang hiệu quả, tạo ra nhiều lợi nhuận hơn cùng kỳ, công ty đang ăn nên làm ra.",
            "en": "This is the profit's growth rate in the second most recent quarter. A high number indicates that the business is thriving and profitable. The company has great potential if the quarterly profit growth rate is greater than 15%. If a company maintains high profit growth rates in the last two quarters, it indicates that the growth is sustainable and the trend might continue in the following quarters."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "quarterRevenueGrowth",
            "lang": {
              "vi": "Tăng trưởng doanh thu thuần QoQ",
              "en": "Net revenue growth QoQ"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Đây là tỷ lệ tăng trưởng doanh thu thuần theo quý (QoQ) của công ty. Nó đo lường mức tăng hoặc giảm doanh thu của công ty so với quý trước đó, cung cấp cái nhìn về đà phát triển kinh doanh ngắn hạn.",
            "en": "This is the quarter-over-quarter (QoQ) growth rate of a company's net revenue. It measures how much a company's revenue has increased or decreased compared to the previous quarter, providing insight into short-term business momentum."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "quarterIncomeGrowth",
            "lang": {
              "vi": "Tăng trưởng lợi nhuận ròng QoQ",
              "en": "Net profit growth QoQ"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Đây là tỷ lệ tăng trưởng lợi nhuận ròng theo quý (QoQ) của công ty. Nó đo lường mức tăng hoặc giảm lợi nhuận của công ty so với quý trước đó, cung cấp cái nhìn về xu hướng khả năng sinh lời ngắn hạn.",
            "en": "This is the quarter-over-quarter (QoQ) growth rate of a company's net profit. It measures how much a company's profit has increased or decreased compared to the previous quarter, providing insight into short-term profitability trends."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "pegForward",
            "lang": {
              "vi": "PEG Foward",
              "en": "PEG Forward"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "PEG Foward (Price/Earnings to Growth) được tính bằng cách chia tỷ lệ P/E cho tốc độ tăng trưởng lợi nhuận. Nó cung cấp bức tranh đầy đủ hơn so với tỷ lệ P/E bằng cách tính đến tăng trưởng lợi nhuận dự kiến của công ty. Tỷ lệ PEG dưới 1 thường được coi là định giá thấp, trong khi tỷ lệ trên 1 có thể cho thấy định giá cao.",
            "en": "The Price/Earnings to Growth (PEG) ratio is calculated by dividing the P/E ratio by the growth rate of earnings. It provides a more complete picture than the P/E ratio by factoring in the company's expected earnings growth. A PEG ratio below 1 is often considered undervalued, while a ratio above 1 may indicate overvaluation."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "pegTrailing",
            "lang": {
              "vi": "PEG Trailing",
              "en": "PEG Trailing"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Chỉ số PEG Trailling được tính bằng tỷ lệ P/E (Giá cổ phiếu / EPS) / tốc độ tăng trưởng EPS so với cùng kỳ. Trong đó EPS = Lợi nhuận sau thuế và sau lợi ích cổ đông thiểu số lũy kế 4 quý gần nhất / Tổng số lượng cổ phiếu đang lưu hành của doanh nghiệp. Chỉ số này giúp nhà đầu tư xác định cổ phiếu có đang được định giá hợp lý không so với mức tăng trưởng thực tế. PEG < 1 có thể chỉ ra cổ phiếu đang bị định giá thấp, trong khi PEG > 1 cho thấy cổ phiếu có thể đang bị định giá cao hơn mức tăng trưởng.",
            "en": "The Trailing PEG ratio is calculated as the P/E ratio (Stock Price / EPS) divided by the EPS growth rate over the comparable period. Here, EPS is defined as the net profit after tax and after accumulated minority interests over the most recent four quarters divided by the total number of outstanding shares. This ratio helps investors determine whether a stock is fairly valued relative to its actual growth rate. A PEG below 1 may indicate that the stock is undervalued, while a PEG above 1 suggests the stock might be overvalued relative to its growth."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "epsTTMGrowth1Year",
            "lang": {
              "vi": "% tăng trưởng EPS TTM trong 1 năm",
              "en": "% growth in EPS TTM over 1 year"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "% tăng trưởng EPS TTM trong 1 năm",
            "en": "% growth in EPS TTM over 1 year"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "epsTTMGrowth5Year",
            "lang": {
              "vi": "% tăng trưởng EPS TTM trong 5 năm",
              "en": "% growth in EPS TTM over 5 year"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "% tăng trưởng EPS TTM trong 5 năm",
            "en": "% growth in EPS TTM over 5 year"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        }
      ]
    },
    {
      "type": {
        "vi": "Chỉ số tài chính",
        "en": "Financial indicators"
      },
      "items": [
        {
          "key": {
            "data": "grossMargin",
            "lang": {
              "vi": "Biên LN gộp",
              "en": "Gross margin"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Biên lợi nhuận gộp = (Doanh thu thuần - Giá vốn hàng bán)/Doanh thu thuần. <br>Thể hiện khả năng sinh lợi của doanh nghiệp, cho biết với mỗi đồng doanh thu thuần, doanh nghiệp tạo ra được bao nhiêu đồng lợi nhuận gộp. Chỉ tiêu này càng duy trì ở mức cao càng tốt, thể hiện lợi thế cạnh tranh của doanh nghiệp, cho phép định giá bán sản phẩm hoặc dịch vụ cung cấp cao hơn nhiều so với giá vốn. Tỷ lệ này thường thấp đối với các doanh nghiệp kinh doanh thương mại, cao hơn ở các doanh nghiệp sản xuất, bất động sản.",
            "en": "Gross profit margin = (Net revenue - COGS) / Net revenue. <br>This ratio shows  a company's profitability, measuring how much gross profit a company earns on each unit of net revenue. The higher this ratio, the better; a high and stable ratio demonstrates that the company has a competitive advantage and can set higher prices for their goods and services in comparison with their COGS. This ratio is usually lower for trading companies and higher for manufacturing and real estate companies."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "netMargin",
            "lang": {
              "vi": "Biên LN ròng",
              "en": "Net margin"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "= Lợi nhuận sau thuế và sau lợi ích cổ đông thiểu số (LNST)/Doanh thu thuần <br>Cho biết với mỗi đồng doanh thu thuần, doanh nghiệp tạo ra được bao nhiêu đồng lợi nhuận sau thuế. Chỉ tiêu này thể hiện khả năng sinh lợi sau thuế của doanh nghiệp nên càng cao càng tốt.",
            "en": "= Profit after tax and minority interests/ Net revenue <br>This ratio measures how much Profit after tax a company earns on each unit of net revenue. It shows a company's profitability; the higher the ratio, the better."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "roe",
            "lang": {
              "vi": "ROE",
              "en": "ROE"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "ROE (Return on Equity) là tỷ suất lợi nhuận trên vốn. <br>ROE = Lợi nhuận sau thuế và sau lợi ích cổ đông thiểu số (R hay Return)/Vốn chủ sở hữu bình quân (E hay Equity). Trong đó: Vốn chủ sở hữu bình quân bằng trung bình cộng giá trị Vốn chủ sở hữu kỳ này và kỳ trước gần nhất. <br>Chỉ tiêu ROE cho biết hiệu quả sử dụng vốn chủ sở hữu của doanh nghiệp, thể hiện qua việc một đồng vốn chủ sở hữu tạo ra được bao nhiêu đồng lợi nhuận sau thuế. Chỉ tiêu này càng cao càng tốt. Con số này sẽ thay đổi tùy theo ngành và tỷ lệ đòn bảy tài chính (A/E) được doanh nghiệp sử dụng, nhưng mức 12-15% thường được tham chiếu: trên mức này được xem là cao, dưới mức này được xem là thấp. Nếu tìm kiếm cơ hội đầu tư nên quan tâm đến các doanh nghiệp có ROE cao hơn mức trung bình ngành. Trung bình của top 200 doanh nghiệp vốn hóa lớn nhất thị trường có ROE là 13.3%.",
            "en": "ROE stands for Return on Equity.  <br>ROE = Profit after tax and minority interests (R or Return) / Average shareholders' equity (E or Equity).  Average Equity = (This period's Equity + Last period's Equity) / 2.  <br>This ratio shows a company's efficiency in using its equity by measuring how much net profit generated by each equity unit. The higher this ratio, the better. This ratio also varies by industry and the company's financial leverage level (A/E), but 12-15% is an usual benchmark: a ratio above this level is considered high, and one below is considered low. If searching for investment opportunities, investors should focus on companies with ROE ratios above their industry average. Average ROE of top 200 enterprises having the greatest market capitalization is 13.3%."
          },
          "additional": {
            "vi": "Trung bình ngành {{industryName}} là {{roe}}.",
            "en": "Besides, average ROE of {{industryName}} sector is {{roe}}"
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "doe",
            "lang": {
              "vi": "D/E",
              "en": "D/E"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "= Nợ vay/Vốn chủ sở hữu (VCSH). Trong đó, Nợ vay = Vay ngắn hạn + Vay dài hạn. <br>Tỷ lệ này thể hiện cơ cấu và tình hình tài chính của doanh nghiệp. Ngoại trừ các định chế tài chính, tỷ lệ Nợ vay/VCSH < 1 thường được xem là an toàn; ở những doanh nghiệp trong ngành như bất động sản, ngành sản xuất cần sử dụng nhiều vốn, tỷ lệ này thường > 1. Nói chung, nên thận trọng với những doanh nghiệp sử dụng đòn bẩy tài chính cao (Nợ vay/ VCSH lên đến vài lần) nhưng sinh lợi thấp.",
            "en": "= Total debt (Debt) / Total shareholders' equity (Equity). Total debt = Short-term debt + Long-term debt. <br>This ratio shows  a company's capital structure and financial situation. Except for financial institutions, a Debt/Equity ratio lower than 1 is generally considered safe; in industries that require a great amount of capital such as real estate and manufacturing, this ratio is usually higher than 1. In general, investors should be careful about companies that have high financial leverage (Debt is many times Equity) but low profitability."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "dividendYield",
            "lang": {
              "vi": "% Cổ tức",
              "en": "%Div yield"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "= Giá trị cổ tức bằng tiền trên một cổ phiếu/Giá thị trường của một cổ phiếu <br>Trong đó, Cổ tức bằng tiền là một phần lợi nhuận thuộc Lợi nhuận sau thuế thuộc Cổ đông công ty mẹ được chia cho cổ đông trong kỳ dưới dạng tiền mặt. Chỉ tiêu này cho biết mức độ sinh lời nhận được từ cổ tức khi đầu tư vào một cổ phiếu; thường được sử dụng bằng cách so sánh với lãi suất tiết kiệm: nếu cao hơn lãi suất tiết kiệm thì đầu tư vào cổ phiếu đó sẽ đem lại hiệu quả cao hơn là gửi tiết kiệm. <br>Trung bình của top 200 doanh nghiệp vốn hóa lớn nhất thị trường có tỷ suất cổ tức là 1.3.",
            "en": "= Cash dividend per share / Stock price. In which, Cash dividend is a part of Profit after tax and minority interests paid out to shareholders in cash. This ratio shows return based on dividend received from investing in a stock and is usually compared with term deposit rates. If it is higher than term deposit rates, an investment in the stock is more effectively than term deposit. <br>Average dividend yield of top 200 largest companies by market cap is 1.3."
          },
          "additional": {
            "vi": "Trung bình ngành {{industryName}} là {{dividend}}.",
            "en": "Besides, average dividend yield of {{industryName}} sector is {{dividend}}."
          },
          "validation": "GOE0",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "eps",
            "lang": {
              "vi": "EPS",
              "en": "EPS"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "EPS là viết tắt của từ Earnings Per Share - lợi nhuận trên một cổ phiếu. <br>EPS = Lợi nhuận sau thuế và sau lợi ích cổ đông thiểu số/ Tổng số lượng cổ phiếu đang lưu hành của doanh nghiệp. EPS cao và tăng trưởng đều đặn có nghĩa là Công ty đang ăn nên làm ra, tạo ra nhiều lợi ích cho cổ đông. Do đó, nhà đầu tư nên ưu tiên lựa chọn những cổ phiếu có EPS cao (ví dụ: trên 3,000 VND/cổ phiếu)",
            "en": "EPS is short for Earnings Per Share. <br>EPS = Profit after tax and minority interest / Total shares outstanding. A high and steadily growing EPS means that the business is profitable and creating benefits for shareholders. Therefore, investors should choose stocks with high EPS values (e.g. more than 3,000 VND per share)"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "pe",
            "lang": {
              "vi": "P/E",
              "en": "P/E"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "= Giá thị trường của một cổ phiếu (P hay Price)/EPS <br>Cho biết với một đồng Lợi nhuận ròng doanh nghiệp thu được (EPS), nhà đầu tư sẵn sàng bỏ ra bao nhiêu đồng cho Giá một cổ phiếu của doanh nghiệp. Cổ phiếu có P/E < 8-10 lần thường được xem là hợp lý nhưng với doanh nghiệp có EPS dự kiến tăng trưởng cao trong tương lai thì doanh nghiệp có thể được chấp nhận mức P/E cao hơn trung bình ngành. <br>Trung bình của top 200 doanh nghiệp vốn hóa lớn nhất thị trường có P/E là 14.7.",
            "en": "= Stock price (P or Price)/EPS. <br>This ratio shows how much investors are willing to pay for a stock based on the company's Earnings per share (EPS). Stocks with P/E ratios less than 8-10x are usually considered fairly priced, but companies with expected high-growth EPS can be accepted at higher P/E ratios than the industry average's. <br>Average P/E of top 200 enterprises having the greatest market capitalization is 14.7."
          },
          "additional": {
            "vi": "Trung bình ngành {{industryName}} là {{priceToEarning}}.",
            "en": "Besides, average P/E of {{industryName}} sector is {{priceToEarning}}"
          },
          "validation": "IS_NUMBER",
          "type": "valuation",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "pb",
            "lang": {
              "vi": "P/B",
              "en": "P/B"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "= Giá thị trường của một cổ phiếu (P)/Giá trị sổ sách một cổ phiếu (B hay BVPS) <br>Cho biết với một đồng Giá trị sổ sách của doanh nghiệp, nhà đầu tư sẵn sàng bỏ ra bao nhiêu đồng cho Giá một cổ phiếu của doanh nghiệp. Chỉ số này thường được áp dụng với các doanh nghiệp trong ngành tài chính, ngân hàng... P/B < 1 lần cho thấy giá cổ phiếu đang giao dịch dưới giá trị sổ sách của doanh nghiệp, có thể được xem là hấp dẫn để đầu tư, nhưng nếu doanh nghiệp có triển vọng tăng trưởng tốt thì P/B có thể cao hơn trung bình ngành. <br>Trung bình của top 200 doanh nghiệp vốn hóa lớn nhất thị trường có P/B là 1.9.",
            "en": "= Stock price (P) / Book value per share (B or BVPS). <br>This ratio shows how much investors are willing to pay for a Stock price based on BVPS. This ratio is usually used in the financial services industry. P/B ratio lower than 1 means that the stock is trading below the company's book value, which can be considered an opportunity for investment. However, a high growth business can have a higher P/B ratio than the industry average's. <br>Average P/B of top 200 enterprises having the greatest market capitalization is 1.9."
          },
          "additional": {
            "vi": "Trung bình ngành {{industryName}} là {{priceToBook}}.",
            "en": "Besides, average P/B of {{industryName}} sector is {{priceToBook}}."
          },
          "validation": "IS_NUMBER",
          "type": "valuation",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "evEbitda",
            "lang": {
              "vi": "EV/EBITDA",
              "en": "EV/EBITDA"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "= EV/EBITDA. Chỉ tiêu này cho biết với một đồng Lợi nhuận hoạt động trước lãi vay, khấu hao và thuế mà doanh nghiệp tạo ra, nhà đầu tư sẵn sàng bỏ ra bao nhiêu đồng cho Giá trị của doanh nghiệp. Tỷ lệ này nếu < 8 lần thường được xem là hấp dẫn để đầu tư. Nếu chất lượng doanh nghiệp tốt (ví dụ doanh nghiệp có sản phẩm tốt, thị phần dẫn đầu ngành, ban lãnh đạo dày dạn kinh nghiệm, quản trị tốt...) thì có thể chấp nhận mức EV/EBITDA cao hơn mức trung bình ngành. <br>Trung bình của top 200 doanh nghiệp vốn hóa lớn nhất thị trường có EV/EBITDA là 12.9.",
            "en": "= EV/EBITDA. This ratio shows how much investors are willing to pay for Enterprise value (EV) based on the company's Earnings before interest, taxes, depreciation and amortization (EBITDA) per share. A ratio lower than 8x is usually considered an opportunity for investment. If the company has strong fundamentals (excellent products, leading market share, experienced management, good governance, etc.), a ratio higher than the industry average's can be accepted. <br>Average EV/EBITDA of top 200 enterprises having the greatest market capitalization is 12.9."
          },
          "additional": {
            "vi": "Trung bình ngành {{industryName}} là {{valueBeforeEbitda}}.",
            "en": "Besides, average EV/EBITDA of {{industryName}} sector is {{valueBeforeEbitda}}"
          },
          "validation": "IS_NUMBER",
          "type": "valuation",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "netCashPerMarketCap",
            "lang": {
              "vi": "Tiền mặt ròng/Vốn hóa",
              "en": "Net cash/Market capitalization"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Tiền mặt ròng/Vốn hóa = (Tiền & tương đương tiền - Tổng nợ vay)/Vốn hóa <br> Chỉ số này càng thấp và nhỏ hơn 0 cho thấy lượng tiền mặt hạn chế và/hoặc nợ vay nhiều, hàm ý rằng sức khỏe tài chính của doanh nghiệp không thực sự lành mạnh. Ngược lại, chỉ số cao thể hiện lượng tiền mặt công ty sở hữu dồi dào, cho thấy nền tảng tài chính lành mạnh. Tuy nhiên, cũng cần lưu ý rằng, việc có số dư tiền mặt lớn có thể cho thấy doanh nghiệp đang thiếu những dự án đầu tư, do đó triển vọng tăng trưởng trong tương lai có thể bị ảnh hưởng. Nhà đầu tư theo trường phái an toàn, thận trọng có thể tìm kiếm những doanh nghiệp có tỷ lệ tiền mặt ròng/vốn hóa ở mức cao (ví dụ: trên 20%).",
            "en": "Net cash/Market capitalization = (Cash & Cash equivalents - Total interest-bearing debt)/Market capitalization <br> A low ratio (possibly under 0) indicates the cash balance is limited or the company has too much interest-bearing debt, which means the financial health of the company might be poor. On the contrary, a high ratio means the company has a great amount of cash and thus good financial health. However, investors should note that a high cash balance might mean that the company lack profitable projects to invest in, which has a negative impact on its growth prospects. Conservative investors can look for companies that have a high Net cash/Market capitalization ratio (e.g. > 20%)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "netCashPerTotalAssets",
            "lang": {
              "vi": "Tiền mặt ròng/Tổng tài sản",
              "en": "Net cash/Total assets"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Tiền mặt ròng/Tổng tài sản = (Tiền & tương đương tiền - Tổng nợ vay)/Tổng tài sản <br> Chỉ số này càng thấp và nhỏ hơn 0 cho thấy lượng tiền mặt hạn chế và/hoặc nợ vay nhiều, hàm ý rằng sức khỏe tài chính của doanh nghiệp không thực sự lành mạnh. Ngược lại, chỉ số cao thể hiện lượng tiền mặt công ty sở hữu dồi dào, cho thấy nền tảng tài chính lành mạnh. Tuy nhiên, cũng cần lưu ý rằng, việc có số dư tiền mặt lớn có thể cho thấy doanh nghiệp đang thiếu những dự án đầu tư, do đó triển vọng tăng trưởng trong tương lai có thể bị ảnh hưởng. Nhà đầu tư theo trường phái an toàn, thận trọng có thể tìm kiếm những doanh nghiệp có tỷ lệ tiền mặt ròng/tổng tài sản ở mức cao (ví dụ: trên 20%).",
            "en": "Net cash/Total Assets = (Cash & Cash equivalents - Total interest-bearing debt)/Total Assets <br> A low ratio (possibly under 0) indicates the cash balance is limited or the company has too much interest-bearing debt, which means the financial health of the company might be poor. On the contrary, a high ratio means the company has a great amount of cash and thus good financial health. However, investors should note that a high cash balance might mean that the company lack profitable projects to invest in, which has a negative impact on its growth prospects. Conservative investors can look for companies that have a high Net cash/Total Assets ratio (e.g. > 20%)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "profitForTheLast4Quarters",
            "lang": {
              "vi": "Lợi nhuận 4 quý gần nhất",
              "en": "TTM Profit"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Là tổng lợi nhuận của doanh nghiệp lũy kế 4 quý gần nhất (TTM). Nhà đầu tư có thể sử dụng chỉ số này để tìm kiếm cơ hội đầu tư ở những doanh nghiệp có quy mô lợi nhuận nhất định, ví dụ: những doanh nghiệp quy mô lợi nhuận nhỏ hơn 500 tỷ VND, quy mô lợi nhuận trung bình từ 500 tỷ VND đến 2000 tỷ VND và quy mô lợi nhuận lớn hơn 2000 tỷ VND.",
            "en": "This is the total profit of the company in the last 4 quarters (TTM). Investors can use this indicator to look for investment opportunities in companies that have a certain amount of profit, e.g. companies with small profits of less than BVND 500 , medium profits from BVND 500 to BVND 2,000, and large profits over 2,000 BVND."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "quarterlyIncome",
            "lang": {
              "vi": "Lợi nhuận ròng quý gần nhất",
              "en": "Most recent quarterly net profit"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Đây là lợi nhuận ròng được công ty báo cáo trong báo cáo tài chính quý gần nhất. Nó cung cấp thông tin về khả năng sinh lời và hiệu suất tài chính hiện tại của công ty.",
            "en": "This is the net profit reported by the company in its most recent quarterly financial statement. It provides insight into the company's current profitability and financial performance."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "quarterlyRevenue",
            "lang": {
              "vi": "Doanh thu thuần quý gần nhất",
              "en": "Most recent quarterly net revenue"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Đây là doanh thu thuần được công ty báo cáo trong báo cáo tài chính quý gần nhất. Nó cung cấp thông tin về hiệu suất bán hàng hiện tại và vị thế thị trường của công ty.",
            "en": "This is the net revenue reported by the company in its most recent quarterly financial statement. It provides insight into the company's current sales performance and market position."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "ps",
            "lang": {
              "vi": "Tỷ lệ P/S",
              "en": "P/S ratio"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Tỷ lệ Giá trên Doanh thu (P/S) được tính bằng cách chia vốn hóa thị trường của công ty cho tổng doanh thu. Nó cho thấy nhà đầu tư sẵn sàng trả bao nhiêu cho mỗi đơn vị doanh thu. Tỷ lệ P/S thấp hơn thường được coi là tốt hơn, mặc dù giá trị phù hợp khác nhau tùy theo ngành.",
            "en": "The Price-to-Sales (P/S) ratio is calculated by dividing a company's market capitalization by its total revenue. It shows how much investors are willing to pay per unit of sales. A lower P/S ratio is generally considered better, though appropriate values vary by industry."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "roa",
            "lang": {
              "vi": "ROA",
              "en": "ROA"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Tỷ suất sinh lời trên tài sản (ROA) được tính bằng cách chia lợi nhuận ròng của công ty cho tổng tài sản. Nó cho thấy hiệu quả sử dụng tài sản để tạo ra lợi nhuận của công ty. ROA cao hơn cho thấy việc sử dụng tài sản và hiệu quả hoạt động tốt hơn.",
            "en": "Return on Assets (ROA) is calculated by dividing a company's net income by its total assets. It shows how efficiently a company is using its assets to generate profits. A higher ROA indicates better asset utilization and operational efficiency."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "nim",
            "lang": {
              "vi": "Biên lãi thuần (NIM)",
              "en": "Net interest margin (NIM)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Biên lãi thuần (NIM) là thước đo sự chênh lệch giữa thu nhập lãi được tạo ra bởi ngân hàng hoặc tổ chức tài chính và số tiền lãi trả cho người cho vay, so với số lượng tài sản sinh lãi của họ. NIM cao hơn cho thấy tổ chức tài chính đang kiếm được nhiều hơn từ các hoạt động cho vay so với những gì nó trả cho nguồn vốn.",
            "en": "Net Interest Margin (NIM) is a measure of the difference between the interest income generated by banks or financial institutions and the amount of interest paid out to their lenders, relative to the amount of their interest-earning assets. A higher NIM indicates the financial institution is earning more from its lending activities compared to what it pays for funds."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "npl",
            "lang": {
              "vi": "Tỷ lệ nợ xấu",
              "en": "Bad debt ratio"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Đối với các tổ chức tài chính, tỷ lệ nợ xấu được tính bằng cách chia các khoản vay không hoạt động cho tổng số khoản vay. Nó cho thấy chất lượng danh mục cho vay của ngân hàng và hiệu quả quản lý rủi ro. Tỷ lệ nợ xấu thấp hơn thường tốt hơn, cho thấy ít khoản vay có vấn đề hơn.",
            "en": "For financial institutions, the bad debt ratio is calculated by dividing non-performing loans by total loans. It indicates the quality of a bank's loan portfolio and its risk management effectiveness. A lower bad debt ratio is generally better, indicating fewer problematic loans."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "equityMI",
            "lang": {
              "vi": "Vốn chủ sở hữu sau lợi ích của cổ đông thiểu số",
              "en": "Equity after Minority Interest"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Vốn chủ sở hữu sau lợi ích của cổ đông thiểu số",
            "en": "Equity after Minority Interest"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "epsRecently",
            "lang": {
              "vi": "EPS quý gần nhất",
              "en": "EPS of the most recent quarter"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "EPS quý gần nhất",
            "en": "EPS of the most recent quarter"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        }
      ]
    },
    {
      "type": {
        "vi": "TCBS đánh giá",
        "en": "TCBS Rating"
      },
      "items": [
        {
          "key": {
            "data": "tcbsRecommend",
            "lang": {
              "vi": "TCBS khuyến nghị",
              "en": "TCBS's recommendations"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "BUY",
              "lang": {
                "vi": "Mua",
                "en": "Buy"
              }
            },
            {
              "data": "SELL",
              "lang": {
                "vi": "Bán",
                "en": "Sell"
              }
            },
            {
              "data": "WAIT_TO_BUY",
              "lang": {
                "vi": "Chờ mua",
                "en": "Wait to buy"
              }
            },
            {
              "data": "WAIT_TO_SELL",
              "lang": {
                "vi": "Chờ bán",
                "en": "Wait to sell"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này giúp nhà đầu tư chọn lọc cổ phiếu dựa trên các tín hiệu MUA, BÁN, CHỜ MUA, CHỜ BÁN của các chuyên gia phân tích TCBS. Ý nghĩa cụ thể của các tín hiệu này như sau: <br>- MUA: Khuyến nghị nhà đầu tư cân nhắc đặt mua tại vùng giá xung quanh mức giá khuyến nghị. <br>- BÁN: Khuyến nghị nhà đầu tư cân nhắc đặt bán tại vùng giá xung quanh mức giá khuyến nghị. <br>- CHỜ MUA: Khuyến nghị nhà đầu tư chưa thực hiện hành động mua mà theo dõi diễn biến của cổ phiếu hoặc diễn biến thị trường chung, tìm kiếm cơ hội mua vào khi giá cổ phiếu điều chỉnh về vùng giá hấp dẫn hoặc khi tín hiệu tăng giá của cổ phiếu rõ ràng hơn <br>- CHỜ BÁN: Khuyến nghị nhà đầu tư chưa thực hiện hành động bán mà theo dõi diễn biến của cổ phiếu hoặc diễn biến thị trường chung, tìm kiếm cơ hội bán ra khi giá cổ phiếu tăng lên mức cao hơn hoặc tín hiệu giảm giá của cổ phiếu rõ ràng hơn.",
            "en": "This indicator helps investors select stocks based on BUY, SELL, AWAITING BUY, AWAITING SELL recommendations of TCBS's analysts. The meaning of these recommendations are as follows: <br>- BUY: Recommending investors to consider placing a buy order at or near the recommended price. <br>- SELL: Recommending investors to consider placing a sell order at or near the recommended price. <br>- AWAITING BUY: Recommending investors not to place a buy order yet, but to continue watching movements of the stock price or the stock market, in order to seek for buying opportunities when the stock price is corrected to an attractive price range or the bullish signal is clearer. <br>- AWAITING SELL: Recommending investors not to place a sell order yet, but to continue watching movements of the stock price or the stock market, in order to seek for selling opportunities when the stock price rises to a higher level or the bearish signal is clearer."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "fundamental",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "stockRating",
            "lang": {
              "vi": "TC Rating",
              "en": "TC Rating"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là chỉ tiêu đánh giá tổng thể về công ty, dựa trên 6 tiêu chí là <br>(1) Mô hình kinh doanh; <br>(2) Hiệu quả hoạt động; <br>(3) Sức khỏe tài chính; <br>(4) Định giá: <br>(5) Điểm kỹ thuật; <br>(6) Sức mạnh giá. <br>Chỉ tiêu này được chấm với thang điểm từ 1 đến 5, tương ứng với các mức Rất kém, Kém, Trung Bình, Tốt, Rất tốt.",
            "en": "TCRating, a tool to present an overall assessment of a company, is based on 6 areas for evaluation: <br>1) Business Model, <br>2) Operating Effectiveness, <br>3) Financial Health, <br>4) Valuation Ratios, <br>5) Technical Score <br>6) Relative Strength. <br>TCRating’s grades range from 1 to 5, with 5 being the highest score and 1 being the lowest."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE1LOE5",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "businessModel",
            "lang": {
              "vi": "Mô hình KD",
              "en": "Business model"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là chỉ tiêu đánh giá định tính về hoạt động kinh doanh của công ty dựa trên các tiêu chí như chất lượng tài sản, chủ sở hữu, ban lãnh đạo công ty, quản trị doanh nghiệp, mức độ thuận lợi trong sản xuất kinh doanh, chất lượng dòng tiền, ngành nghề công ty đang hoạt động, vị thế của công ty trong ngành và rủi ro về hoạt động của công ty. Chỉ tiêu này được chấm điểm bởi các chuyên gia phân tích của TCBS với thang điểm từ 1 đến 5, tương ứng với các mức Rất kém, Kém, Trung Bình, Tốt, Rất tốt.",
            "en": "Business model is a fundamental indicator which evaluates a company's business operations using qualitative factors such as asset quality, owners, board of management, corporate governance, advantageous conditions for business operations, cash flow quality, business sector, company stature in the industry and its operational risks. TCBS' analysts grades this indicator on a scale of 1 to 5, which corresponds with Very poor, Poor, Average, Good, Very good."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE1LOE5",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "businessOperation",
            "lang": {
              "vi": "Hiệu quả HĐ",
              "en": "Operational efficiency"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là chỉ tiêu đánh giá mức độ hiệu quả trong hoạt động kinh doanh của công ty dựa trên các tiêu chí như ROA, ROE, tăng trưởng doanh thu, lợi nhuận, EBITDA, FCFE bình quân 5 năm, biên lợi nhuận gộp, biên lợi nhuận hoạt động, biên lợi nhuận ròng. <br>Chỉ tiêu này được chấm với thang điểm từ 1 đến 5, tương ứng với các mức Rất kém, Kém, Trung Bình, Tốt, Rất tốt.",
            "en": "Operational efficiency is an indicator which evaluates the efficiency of a company's business operations through ROA, ROE, revenue growth, profit, EBITDA, FCFE 5-year average, gross profit margin, operating profit margin, and net profit margin. <br> This indicator is graded on a scale of 1 to 5, which corresponds with Very poor, Poor, Average, Good, Very good."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE1LOE5",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "financialHealth",
            "lang": {
              "vi": "Sức khoẻ TC",
              "en": "Financial health"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là chỉ tiêu đánh giá tình hình tài chính của công ty dựa trên khả năng đáp ứng các nghĩa vụ nợ ngắn hạn (gồm khả năng thanh toán hiện hành, khả năng thanh toán nhanh) và khả năng đáp ứng các nghĩa vụ nợ dài hạn (gồm Hệ số thanh toán lãi vay, Nợ vay ròng/EBITDA, Nợ vay ròng/Vốn chủ sở hữu). <br>Chỉ tiêu này được chấm với thang điểm từ 1 đến 5, tương ứng với các mức Rất kém, Kém, Trung Bình, Tốt, Rất tốt.",
            "en": "Financial health is an indicator of a company's financial position based on its ability to meet short-term obligations (current ratio, quick ratio) and long-term obligations (interest coverage ratio, Debt/EBITDA, D/E). <br>This indicator is graded on a scale of 1 to 5, which corresponds with Very poor, Poor, Average, Good, Very good."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE1LOE5",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        }
      ]
    },
    {
      "type": {
        "vi": "Biến động giá & KL",
        "en": "Price & Volume volatility"
      },
      "items": [
        {
          "key": {
            "data": "suddenlyHighVolumeMatching",
            "lang": {
              "vi": "Tốc độ khớp lệnh",
              "en": "Trading speed"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "Chỉ tiêu này được tính toán bằng cách lấy tốc độ khớp lệnh hiện tại chia cho tốc độ khớp lệnh trung bình 5 ngày gần nhất; trong đó, tốc độ khớp lệnh hiện tại được tính bằng tổng số lượng cổ phiếu khớp lệnh trong một phút gần nhất. <br>Tỷ lệ này lớn hơn 2 cho thấy cổ phiếu đang thu hút được lượng lớn nhà đầu tư tham gia. Nếu giá tăng kết hợp với tốc độ khớp lệnh đột biến cho thấy nhà đầu tư đang mua mạnh cổ phiếu này. Ngược lại, tốc độ khớp lệnh đột biến đi kèm với sự giảm giá cho thấy nhà đầu tư đang bán mạnh cổ phiếu này.",
            "en": "This indicator detects unusual order matching activities by dividing the current order matching speed by the 5-day-average matching speed.  The order matching speed is measured by the number of matched stocks in the last minute. <br>A result of greater than 2 indicates a surge of interest in the stock. When a stock’s price rises and experiences a surge in matching activities, the Abnormal trading speed indicator can reveal bullish signals from the market. Conversely, a price dip along with a surge in matching activities hints bearish signals from the market."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "totalTradingValue",
            "lang": {
              "vi": "GT khớp lệnh",
              "en": "Matched value"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Là tiêu chí lọc cổ phiếu theo tổng giá trị khớp lệnh trong phiên. Nhà đầu tư có thể sử dụng tiêu chí này để xác định những cổ phiếu có giá trị giao dịch phù hợp với quy mô tài sản ròng (NAV) của mình.",
            "en": "This filter indicates the total value of matched orders in the trading day. Investors can use this filter to look for stocks with appropriate values of matched orders for their portfolio's net asset value (NAV)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "avgTradingValue5Day",
            "lang": {
              "vi": "GTGD 1 tuần",
              "en": "1-week liquidity"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Là tiêu chí lọc cổ phiếu theo giá trị giao dịch trung bình 5 phiên gần nhất. Nhà đầu tư có thể sử dụng tiêu chí này để xác định những cổ phiếu có giá trị giao dịch trung bình phù hợp với quy mô tài sản ròng (NAV) của mình.",
            "en": "This is the average trading value over the last 5 trading days. Investors can use this filter to look for stocks with appropriate average trading values for their portfolio's net asset value (NAV)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "avgTradingValue10Day",
            "lang": {
              "vi": "GTGD 10 ngày",
              "en": "10-days liquidity"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Là tiêu chí lọc cổ phiếu theo giá trị giao dịch trung bình 10 phiên gần nhất. Nhà đầu tư có thể sử dụng tiêu chí này để xác định những cổ phiếu có giá trị giao dịch trung bình phù hợp với quy mô tài sản ròng (NAV) của mình.",
            "en": "This is the average trading value over the last 10 trading days. Investors can use this filter to look for stocks with appropriate average trading values for their portfolio's net asset value (NAV)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "avgTradingValue20Day",
            "lang": {
              "vi": "GTGD 1 tháng",
              "en": "1-month liquidity"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "billion",
            "lang": {
              "vi": "tỷ",
              "en": "billion"
            }
          },
          "tooltip": {
            "vi": "Là tiêu chí lọc cổ phiếu theo giá trị giao dịch trung bình 20 phiên gần nhất. Nhà đầu tư có thể sử dụng tiêu chí này để xác định những cổ phiếu có giá trị giao dịch trung bình phù hợp với quy mô tài sản ròng (NAV) của mình.",
            "en": "This is the average trading value over the last 20 trading days. Investors can use this filter to look for stocks with appropriate average trading values for their portfolio's net asset value (NAV)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "priceGrowth1Day",
            "lang": {
              "vi": "% Thay đổi giá hôm nay",
              "en": "Price change in day"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Chỉ số % Thay đổi giá ngày hôm nay đo lường sự thay đổi giá cổ phiếu so với ngày giao dịch trước đó, tính bằng Giá hôm nay (T) / Giá đóng cửa điều chỉnh phiên liền trước (T-1) - 1. Chỉ số này giúp nhà đầu tư theo dõi biến động giá cổ phiếu trong ngày và đánh giá xu hướng thị trường.",
            "en": "This metric measures the percentage change in the stock price compared to the previous trading day. It is calculated as (Today's Price (T) / Adjusted Closing Price from the previous session (T-1)) - 1. This index helps investors track intraday price movements and assess market trends."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "priceGrowth1Week",
            "lang": {
              "vi": "% Thay đổi giá 1 tuần",
              "en": "Price change in week"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Chỉ số % Thay đổi giá 1 tuần đo lường sự thay đổi giá cổ phiếu so với cùng ngày tuần trước đó, tính bằng Giá hôm nay (T) / Giá đóng cửa điều chỉnh phiên giao dịch cùng ngày của tuần trước. Chỉ số này giúp nhà đầu tư theo dõi biến động giá cổ phiếu trong ngày và đánh giá xu hướng ngắn hạn của cổ phiếu.",
            "en": "This metric measures the percentage change in the stock price compared to the same day of the previous week. It is calculated as Today's Price (T) divided by the Adjusted Closing Price of the trading session on the same day of the previous week. This indicator assists investors in monitoring short-term price movements and evaluating the stock’s short-term trend."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "priceGrowth1Month",
            "lang": {
              "vi": "% Thay đổi giá 1 tháng",
              "en": "Price change in month"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Chỉ số % Thay đổi giá 1 tháng đo lường sự thay đổi giá cổ phiếu so với cùng ngày tháng trước trước đó, tính bằng Giá hôm nay (T) / Giá đóng cửa điều chỉnh phiên giao dịch cùng ngày của tháng trước. Chỉ số này giúp nhà đầu tư theo dõi biến động giá cổ phiếu trong ngày và đánh giá xu hướng dài hạn hơn so với các biến động trong ngắn hạn.",
            "en": "This metric measures the percentage change in the stock price compared to the same day of the previous month. It is calculated as Today's Price (T) divided by the Adjusted Closing Price of the trading session on the corresponding day of the previous month. This indicator helps investors observe price fluctuations and assess longer-term trends compared to short-term movements."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percent1YearFromPeak",
            "lang": {
              "vi": "% cách đỉnh 1 năm",
              "en": "% from 1-year high"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Đỉnh 1 năm có thể đóng vai trò một ngưỡng kháng cự mạnh và quan trọng. Khi một cổ phiếu vượt qua mốc này, đà tăng của cổ phiếu có thể được tiếp diễn và cổ phiếu có xu hướng lập đỉnh cao hơn nữa. Chỉ tiêu này sẽ giúp bạn xác định những cổ phiếu đang gần với mức đỉnh 1 năm. Ví dụ, bạn có thể lọc những cổ phiếu đang cách 10% hoặc đã vượt qua đỉnh 1 năm. Đây là những cổ phiếu có xu hướng mạnh, có tiềm năng tiếp tục tăng giá để tạo ra những đỉnh giá cao hơn nữa. Lưu ý: Số âm thể hiện giá hiện tại đang thấp hơn và số dương thể hiện giá hiện tại đang cao hơn mức đỉnh 1 năm",
            "en": "The 1-year high can act as an important and solid resistance level for the stock price. When a stock rises above this level, the momentum can persist and the stock might continue trending up. This indicator will help you identify stocks trading near their 1-year highs. For example, you can filter for stocks trading 10% below their 1-year highs or have surpassed their 1-year highs. These are stocks with strong upward momentum, which can continue increasing in price to establish new highs. Note: A negative number means the current price is lower and a positive number means the current price is higher than the 1-year high."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percentAwayFromHistoricalPeak",
            "lang": {
              "vi": "% cách đỉnh lịch sử ",
              "en": "% from all-time high"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Đỉnh lịch sử có thể đóng vai trò một ngưỡng kháng cự mạnh và quan trọng. Khi một cổ phiếu vượt qua mốc này, đà tăng của cổ phiếu có thể được tiếp diễn và cổ phiếu có xu hướng lập đỉnh cao hơn nữa. Chỉ tiêu này sẽ giúp bạn xác định những cổ phiếu đang gần với mức đỉnh lịch sử. Ví dụ, bạn có thể lọc những cổ phiếu đang cách 10% hoặc đã vượt qua đỉnh lịch sử. Đây là những cổ phiếu có xu hướng mạnh, có tiềm năng tiếp tục tăng giá để tạo ra những đỉnh giá cao hơn nữa. Lưu ý: Số âm thể hiện giá hiện tại đang thấp hơn và số dương thể hiện giá hiện tại đang cao hơn mức đỉnh lịch sử",
            "en": "The all-time high can act as an important and solid resistance level for the stock price. When a stock rises above this level, the momentum can persist and the stock might continue trending up. This indicator will help investors identify stocks trading near their all-time highs. For example, you can filter for stocks trading 10% below their all-time highs or have surpassed their all-time highs. These are stocks with strong upward momentum, which can continue increasing in price to establish new highs. Note: A negative number means the current price is lower and a positive number means the current price is higher than the all-time high."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percent1YearFromBottom",
            "lang": {
              "vi": "% cách đáy 1 năm",
              "en": "% from 1-year low"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Đáy 1 năm đóng vai trò một ngưỡng hỗ trợ mạnh và quan trọng. Khi một cổ phiếu phá vỡ mốc này, nó có thể kích hoạt đà bán tháo của nhà đầu tư, cổ phiếu có xu hướng tiếp tục giảm mạnh. Chỉ tiêu này sẽ giúp nhà đầu tư có thể xác định được những cổ phiếu đang gần với đáy 1 năm để cân nhắc không tham gia hoặc thoát vị thế khỏi những cổ phiếu đó. Tuy nhiên, đối với nhà đầu tư theo trường phái \"giá trị\" hoặc có khẩu vị rủi ro cao, việc cổ phiếu giảm về đáy 1 năm cũng mở ra cơ hội để mua cổ phiếu với giá rẻ. <br>Lưu ý: Số âm thể hiện giá hiện tại đang thấp hơn và số dương thể hiện giá hiện tại đang cao hơn mức đáy 1 năm",
            "en": "The 1-year low can act as an important and solid support level for the stock price. When a stock falls below this level, it can trigger panic selling and the stock might continue trending down. This indicator will help investors identify stocks trading near their 1-year lows to consider avoiding or selling them. However, for value investors and risk seekers, stocks that decline to their 1-year lows can be good bargains in the market. <br>Note: A negative number means the current price is lower and a positive number means the current price is higher than the 1-year low."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percentOffHistoricalBottom",
            "lang": {
              "vi": "% cách đáy lịch sử ",
              "en": "% from all-time low"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Đáy lịch sử đóng vai trò một ngưỡng hỗ trợ mạnh và quan trọng. Khi một cổ phiếu phá vỡ mốc này, nó có thể kích hoạt đà bán tháo của nhà đầu tư, cổ phiếu có xu hướng tiếp tục giảm mạnh. Chỉ tiêu này sẽ giúp nhà đầu tư có thể xác định được những cổ phiếu đang gần với đáy lịch sử để cân nhắc không tham gia hoặc thoát vị thế khỏi những cổ phiếu đó. Tuy nhiên, đối với nhà đầu tư theo trường phái \"giá trị\" hoặc có khẩu vị rủi ro cao, việc cổ phiếu giảm về đáy lịch sử cũng mở ra cơ hội để mua cổ phiếu với giá rẻ. <br>Lưu ý: Số âm thể hiện giá hiện tại đang thấp hơn và số dương thể hiện giá hiện tại đang cao hơn mức đáy lịch sử",
            "en": "The all-time low can act as an important and solid support level for the stock price. When a stock falls below this level, it can trigger panic selling and the stock might continue trending down. This indicator will help investors identify stocks trading near their all-time lows to consider avoiding or selling them. However, for value investors and risk seekers, stocks that decline to their all-time lows can be good bargains in the market. <br>Note: A negative number means the current price is lower and a positive number means the current price is higher than the all-time low."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "fundamental",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "priceVsSMA5",
            "lang": {
              "vi": "Giá vs SMA(5)",
              "en": "Price vs SMA(5)"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "CROSS_ABOVE",
              "lang": {
                "vi": "Giá cắt lên SMA(5)",
                "en": "Crossed above SMA(5)"
              }
            },
            {
              "data": "CROSS_BELOW",
              "lang": {
                "vi": "Giá cắt xuống SMA(5)",
                "en": "Crossed below SMA(5)"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này xác định trạng thái giá cổ phiếu so với trung bình 5 ngày (MA5). Giá vượt đường MA5 cho thấy giá hiện tại đang cao hơn bình quân 5 ngày gần nhất, báo hiệu xu hướng có thể tăng giá trong ngắn hạn. Ngược lại, giá cắt xuống dưới đường MA5 cho thấy giá hiện tại đang thấp hơn bình quân 5 ngày gần nhất, báo hiệu xu hướng có thể giảm giá trong ngắn hạn.",
            "en": "This indicator compares a stock’s current price with its 5-day-average price (MA5). A stock’s price surpassing the MA5 can signify an uptrend forming in the short-term. Contrarility, a stock’s price dipping below the MA5 may signal a downtrend in the short term."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "priceVsSma10",
            "lang": {
              "vi": "Giá vs SMA(10)",
              "en": "Price Vs SMA(10)"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "CROSS_ABOVE",
              "lang": {
                "vi": "Giá cắt lên SMA(10)",
                "en": "Crossed above SMA(10)"
              }
            },
            {
              "data": "CROSS_BELOW",
              "lang": {
                "vi": "Giá cắt xuống SMA(10)",
                "en": "Crossed below SMA(10)"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này xác định trạng thái giá cổ phiếu so với trung bình 10 ngày (MA10). Giá vượt đường MA10 cho thấy giá hiện tại đang cao hơn bình quân 10 ngày gần nhất, báo hiệu xu hướng có thể tăng giá trong ngắn hạn. Do đó, nhà đầu tư có thể cân nhắc mua khi giá cổ phiếu cắt lên trên đường MA10, kết hợp với việc khối lượng và/hoặc tốc độ khớp lệnh tăng đột biến. <br> Ngược lại, giá cắt xuống dưới đường MA10 cho thấy giá hiện tại đang thấp hơn bình quân 10 ngày gần nhất, báo hiệu xu hướng có thể giảm giá trong ngắn hạn. Do đó, nhà đầu tư có thể cân nhắc bán cổ phiếu khi giá cắt xuống dưới đường MA10, kết hợp với việc khối lượng và/hoặc tốc độ khớp lệnh tăng đột biến.",
            "en": "This indicator determines the status of the stock price compared to its 10-days average (MA10). If the price rises above the MA10, it means that the current price is higher than its average price over the last 10 trading days, which signals an uptrend in the short term. Investors might consider placing a buy order when the price crosses above the MA10, accompanied by a sharp increase in volume and/or abnormal increasing trading speed. <br> On the contrary, if the price falls below the MA10, it means that the current price is lower than its average price over the last 10 trading days, which signals a downtrend in the short term. Investors might consider placing a sell order when the price crosses below the MA10, accompanied by a sharp increase in volume and/or abnormal increasing trading speed."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "priceVsSMA20",
            "lang": {
              "vi": "Giá vs SMA(20)",
              "en": "Price vs SMA(20)"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "CROSS_ABOVE",
              "lang": {
                "vi": "Giá cắt lên SMA(20)",
                "en": "Crossed above SMA(20)"
              }
            },
            {
              "data": "CROSS_BELOW",
              "lang": {
                "vi": "Giá cắt xuống SMA(20)",
                "en": "Crossed below SMA(20)"
              }
            },
            {
              "data": "ABOVE",
              "lang": {
                "vi": "Giá nằm trên SMA(20)",
                "en": "Above SMA(20)"
              }
            },
            {
              "data": "BELOW",
              "lang": {
                "vi": "Giá nằm dưới SMA(20)",
                "en": "Below SMA(20)"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này xác định trạng thái giá cổ phiếu so với trung bình 20 ngày (MA20). Giá vượt đường MA20 cho thấy giá hiện tại đang cao hơn bình quân 20 ngày gần nhất, báo hiệu xu hướng có thể tăng giá trong ngắn hạn. Ngược lại, giá cắt xuống dưới đường MA20 cho thấy giá hiện tại đang thấp hơn bình quân 20 ngày gần nhất, báo hiệu xu hướng có thể giảm giá trong ngắn hạn.",
            "en": "This indicator compares a stock’s current price with its 20-day-average price (MA20). A stock’s price surpassing the MA20 can signify an uptrend forming in the short-term. Contrarility, a stock’s price dipping below the MA20 may signal a downtrend in the short term."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "priceVsSma50",
            "lang": {
              "vi": "Giá vs SMA(50)",
              "en": "Price Vs SMA(50)"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "CROSS_ABOVE",
              "lang": {
                "vi": "Giá cắt lên SMA(50)",
                "en": "Crossed above SMA(50)"
              }
            },
            {
              "data": "CROSS_BELOW",
              "lang": {
                "vi": "Giá cắt xuống SMA(50)",
                "en": "Crossed below SMA(50)"
              }
            },
            {
              "data": "ABOVE",
              "lang": {
                "vi": "Giá nằm trên SMA(50)",
                "en": "Above SMA(50)"
              }
            },
            {
              "data": "BELOW",
              "lang": {
                "vi": "Giá nằm dưới SMA(50)",
                "en": "Below SMA(50)"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này xác định trạng thái giá cổ phiếu so với trung bình 50 ngày (MA50). Giá vượt đường MA50 cho thấy giá hiện tại đang cao hơn bình quân 50 ngày gần nhất, báo hiệu xu hướng có thể tăng giá trong trung hạn. Do đó, nhà đầu tư có thể cân nhắc mua khi giá cổ phiếu cắt lên trên đường MA50, kết hợp với việc khối lượng và/hoặc tốc độ khớp lệnh tăng đột biến. <br> Ngược lại, giá cắt xuống dưới đường MA50 cho thấy giá hiện tại đang thấp hơn bình quân 50 ngày gần nhất, báo hiệu xu hướng có thể giảm giá trong trung hạn. Do đó, nhà đầu tư có thể cân nhắc bán cổ phiếu khi giá cắt xuống dưới đường MA10, kết hợp với việc khối lượng và/hoặc tốc độ khớp lệnh tăng đột biến.",
            "en": "This indicator determines the status of the stock price compared to its 50-days average  (MA50). If the price rises above the MA50, it means that the current price is higher than its average price over the last 50 trading days, which signals an uptrend in the short term. Investors might consider placing a buy order when the price crosses above the MA50, accompanied by a sharp increase in volume and/or abnormal increasing trading speed. <br>On the contrary, if the price falls below the MA50, it means that the current price is lower than its average price over the last 50 trading days, which signals a downtrend in the short term. Investors might consider placing a sell order when the price crosses below the MA50, accompanied by a sharp increase in volume and/or abnormal increasing trading speed."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "priceVsSMA100",
            "lang": {
              "vi": "Giá vs SMA(100)",
              "en": "Price vs SMA(100)"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "ABOVE",
              "lang": {
                "vi": "Giá nằm trên SMA(100)",
                "en": "Above SMA(100)"
              }
            },
            {
              "data": "BELOW",
              "lang": {
                "vi": "Giá nằm dưới SMA(100)",
                "en": "Below SMA(100)"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này xác định trạng thái giá cổ phiếu so với giá trung bình 100 ngày gần nhất. Giá nằm trên đường SMA(100) cho thấy giá hiện tại đang cao hơn giá trung bình 100 ngày gần nhất, củng cố xu hướng tăng giá trong trung hạn. Ngược lại, giá nằm dưới đường SMA(100) cho thấy giá hiện tại đang thấp hơn giá trung bình 100 ngày gần nhất, báo hiệu xu hướng giảm giá trung hạn.",
            "en": "This indicator compares a stock’s current price with its 100-day-average price, or SMA(100). A stock’s price surpassing the SMA(100) can signify an uptrend forming in the short-term. On the contrary, a stock’s price dipping below the SMA(100) may signal a downtrend in the short term."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "priceVsSMA200",
            "lang": {
              "vi": "Giá vs SMA(200)",
              "en": "Price vs SMA(200)"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "CROSS_ABOVE",
              "lang": {
                "vi": "Giá cắt lên SMA(200)",
                "en": "Crossed above SMA(200)"
              }
            },
            {
              "data": "CROSS_BELOW",
              "lang": {
                "vi": "Giá cắt xuống SMA(200)",
                "en": "Crossed below SMA(200)"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này xác định trạng thái giá cổ phiếu so với trung bình 200 ngày (MA200). Giá vượt đường MA200 cho thấy giá hiện tại đang cao hơn bình quân 200 ngày gần nhất, báo hiệu xu hướng có thể tăng giá trong ngắn hạn. Ngược lại, giá cắt xuống dưới đường MA200 cho thấy giá hiện tại đang thấp hơn bình quân 200 ngày gần nhất, báo hiệu xu hướng có thể giảm giá trong ngắn hạn.",
            "en": "This indicator determines the stock’s current price relative to its 200-day Simple Moving Average (SMA200). When the price is above the SMA200, it indicates that the current price is higher than the average of the most recent 200 days, potentially signaling an upward trend in the short term. Conversely, when the price falls below the SMA200, it signals that the current price is lower than the 200-day average, potentially indicating a short-term downtrend."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "forecastVolumeRatio",
            "lang": {
              "vi": "KL dự kiến so với SMA(5)",
              "en": "Expected volume vs SMA(5)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "Chỉ tiêu này giúp phát hiện các mã cổ phiếu có giao dịch bùng nổ trong ngày, được tính toán bằng cách lấy khối lượng giao dịch dự kiến của ngày hiện tại chia cho khối lượng giao dịch trung bình 5 ngày gần nhất. Tỷ lệ này lớn hơn 2 cho thấy cổ phiếu đang thu hút được lượng lớn nhà đầu tư tham gia.",
            "en": "This indicator identifies a stock’s spike in volume by dividing the expected trading volume of the current session by the average trading volume of the last 5 days. A result of greater than 2 indicates a surge of interest in the stock."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "volumeVsVSma5",
            "lang": {
              "vi": "Khối lượng so với SMA(5)",
              "en": "Volume Vs SMA(5)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "Chỉ tiêu này giúp phát hiện các mã cổ phiếu có giao dịch bùng nổ trong ngày, được tính toán bằng cách lấy khối lượng lũy kế tới thời điểm hiện tại chia cho khối lượng giao dịch trung bình 5 ngày gần nhất. Tỷ lệ này càng lớn càng thể hiện cổ phiếu đang thu hút được nhiều nhà đầu tư tham gia. Do đó, nhà đầu tư có thể cân nhắc mua khi giá cổ phiếu tăng, kết hợp với khối lượng gia tăng.",
            "en": "This indicator helps investors identify stocks that have unusually high volume during the trading day, and it is calculated by dividing the cumulative volume up to the present by the average volume within the last 5 days. A higher ratio means that the stock is attracting more investors. Therefore, investors might consider buying when the stock price increases, accompanied by high volume."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "volumeVsVSma10",
            "lang": {
              "vi": "Khối lượng so với SMA(10)",
              "en": "Volume Vs SMA(10)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "Chỉ tiêu này giúp phát hiện các mã cổ phiếu có giao dịch bùng nổ trong ngày, được tính toán bằng cách lấy khối lượng lũy kế tới thời điểm hiện tại chia cho khối lượng giao dịch trung bình 10 ngày gần nhất. Tỷ lệ này càng lớn càng thể hiện cổ phiếu đang thu hút được nhiều nhà đầu tư tham gia. Do đó, nhà đầu tư có thể cân nhắc mua khi giá cổ phiếu tăng, kết hợp với khối lượng gia tăng.",
            "en": "This indicator helps investors identify stocks that have unusually high volume during the trading day, and it is calculated by dividing the cumulative volume up to the present by the average volume within the last 10 days. A higher ratio means that the stock is attracting more investors. Therefore, investors might consider buying when the stock price increases, accompanied by high volume."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "volumeVsVSma20",
            "lang": {
              "vi": "Khối lượng so với SMA(20)",
              "en": "Volume Vs SMA(20)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "Chỉ tiêu này giúp phát hiện các mã cổ phiếu có giao dịch bùng nổ trong ngày, được tính toán bằng cách lấy khối lượng lũy kế tới thời điểm hiện tại chia cho khối lượng giao dịch trung bình 20 ngày gần nhất. Tỷ lệ này càng lớn càng thể hiện cổ phiếu đang thu hút được nhiều nhà đầu tư tham gia. Do đó, nhà đầu tư có thể cân nhắc mua khi giá cổ phiếu tăng, kết hợp với khối lượng gia tăng.",
            "en": "This indicator helps investors identify stocks that have unusually high volume during the trading day, and it is calculated by dividing the cumulative volume up to the present by the average volume within the last 20 days. A higher ratio means that the stock is attracting more investors. Therefore, investors might consider buying when the stock price increases, accompanied by high volume."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "volumeVsVSma50",
            "lang": {
              "vi": "Khối lượng so với SMA(50)",
              "en": "Volume Vs SMA(50)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "times",
            "lang": {
              "vi": "lần",
              "en": "times"
            }
          },
          "tooltip": {
            "vi": "Chỉ tiêu này giúp phát hiện các mã cổ phiếu có giao dịch bùng nổ trong ngày, được tính toán bằng cách lấy khối lượng lũy kế tới thời điểm hiện tại chia cho khối lượng giao dịch trung bình 50 ngày gần nhất. Tỷ lệ này càng lớn càng thể hiện cổ phiếu đang thu hút được nhiều nhà đầu tư tham gia. Do đó, nhà đầu tư có thể cân nhắc mua khi giá cổ phiếu tăng, kết hợp với khối lượng gia tăng.",
            "en": "This indicator helps investors identify stocks that have unusually high volume during the trading day, and it is calculated by dividing the cumulative volume up to the present by the average volume within the last 50 days. A higher ratio means that the stock is attracting more investors. Therefore, investors might consider buying when the stock price increases, accompanied by high volume."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "vsma5",
            "lang": {
              "vi": "KL giao dịch trung bình 5 phiên",
              "en": "5-day average trading volume"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "thousand",
            "lang": {
              "vi": "nghìn",
              "en": "thousand"
            }
          },
          "tooltip": {
            "vi": "Khối lượng giao dịch trung bình 5 phiên là chỉ số đo lường khối lượng giao dịch trung bình của cổ phiếu trong 5 phiên giao dịch gần nhất. Chỉ số này giúp nhà đầu tư đánh giá mức độ thanh khoản của cổ phiếu và nhận diện các xu hướng giao dịch trong ngắn hạn. Công thức tính là tổng khối lượng giao dịch của 5 phiên chia cho 5.",
            "en": "This indicator measures the average trading volume of a stock over the last 5 trading sessions. It helps investors assess the stock’s liquidity and identify short-term trading trends. The calculation is the total trading volume over 5 sessions divided by 5."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "vsma10",
            "lang": {
              "vi": "KL giao dịch trung bình 10 phiên",
              "en": "10-day average trading volume"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "thousand",
            "lang": {
              "vi": "nghìn",
              "en": "thousand"
            }
          },
          "tooltip": {
            "vi": "Khối lượng giao dịch trung bình 10 phiên là chỉ số đo lường khối lượng giao dịch trung bình của cổ phiếu trong 10 phiên giao dịch gần nhất. Chỉ số này giúp nhà đầu tư đánh giá mức độ thanh khoản của cổ phiếu trong khoảng thời gian dài hơn và nhận diện các xu hướng giao dịch. Công thức tính là tổng khối lượng giao dịch của 10 phiên chia cho 10.",
            "en": "This indicator measures the average trading volume of a stock over the last 10 trading sessions. It helps investors evaluate the stock’s liquidity over a longer period and identify trading trends. The formula is the total trading volume over 10 sessions divided by 10."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "vsma20",
            "lang": {
              "vi": "KL giao dịch trung bình 20 phiên",
              "en": "20-day average trading volume"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "thousand",
            "lang": {
              "vi": "nghìn",
              "en": "thousand"
            }
          },
          "tooltip": {
            "vi": "Khối lượng giao dịch trung bình 20 phiên là chỉ số đo lường khối lượng giao dịch trung bình của cổ phiếu trong 20 phiên giao dịch gần nhất. Chỉ số này giúp nhà đầu tư đánh giá mức độ thanh khoản của cổ phiếu trong khoảng thời gian dài hơn và nhận diện các xu hướng giao dịch ổn định hơn. Công thức tính là tổng khối lượng giao dịch của 20 phiên chia cho 20.",
            "en": "This indicator measures the average trading volume of a stock over the last 20 trading sessions. It assists investors in assessing the liquidity of the stock over a longer period and in identifying more stable trading trends. The calculation is the total trading volume over 20 sessions divided by 20."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "vsma50",
            "lang": {
              "vi": "KL giao dịch trung bình 50 phiên",
              "en": "50-day average trading volume"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "thousand",
            "lang": {
              "vi": "nghìn",
              "en": "thousand"
            }
          },
          "tooltip": {
            "vi": "Khối lượng giao dịch trung bình 50 phiên là chỉ số đo lường khối lượng giao dịch trung bình của cổ phiếu trong 50 phiên giao dịch gần nhất. Chỉ số này giúp nhà đầu tư nhận diện xu hướng giao dịch dài hạn và đánh giá sự ổn định của thanh khoản cổ phiếu trong một khoảng thời gian dài. Công thức tính là tổng khối lượng giao dịch của 50 phiên chia cho 50.",
            "en": "This indicator measures the average trading volume of a stock over the last 50 trading sessions. It helps investors identify longer-term trading trends and evaluate the stability of the stock’s liquidity over an extended period. The formula is the total trading volume over 50 sessions divided by 50."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percentPriceVsMa20",
            "lang": {
              "vi": "% giá hiện tại so với MA20",
              "en": "% current price relative to MA20"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "% giá hiện tại so với MA20",
            "en": "% current price relative to MA20"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percentPriceVsMa50",
            "lang": {
              "vi": "% giá hiện tại so với MA50",
              "en": "% current price relative to MA50"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "% giá hiện tại so với MA50",
            "en": "% current price relative to MA50"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percentPriceVsMa100",
            "lang": {
              "vi": "% giá hiện tại so với MA100",
              "en": "% current price relative to MA100"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "% giá hiện tại so với MA100",
            "en": "% current price relative to MA100"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "percentPriceVsMa200",
            "lang": {
              "vi": "% giá hiện tại so với MA200",
              "en": "% current price relative to MA200"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "% giá hiện tại so với MA200",
            "en": "% current price relative to MA200"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        }
      ]
    },
    {
      "type": {
        "vi": "Hành vi thị trường",
        "en": "Market behavior"
      },
      "items": [
        {
          "key": {
            "data": "strongBuyPercentage",
            "lang": {
              "vi": "% Dư mua",
              "en": "% Bid"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là tỷ lệ của Tổng khối lượng dư mua của 3 mức giá đặt mua cao nhất / (Tổng khối lượng dư mua của 3 mức giá đặt mua cao nhất + Tổng khối lượng dư bán tại 3 mức giá đặt bán thấp nhất) của cổ phiếu tại một thời điểm. Tính theo %. <br>Tỷ lệ ở mức quanh 50% cho thấy lượng cung cầu và sự quan tâm đang ngang nhau giữa người mua và bán. Tỷ lệ này lớn hơn 70% thể hiện cổ phiếu đang thu hút sự quan tâm lớn của người mua. Và ngược lại, tỷ lệ nhỏ hơn 30% sẽ cho thấy sự bi quan về cổ phiếu này.",
            "en": "%Bid volume is the ratio of the Total volume of the 3 current highest bids / (Total volume of the 3 current highest bids + Total volume of the 3 current lowest asks) of a stock, expressed in percentage. <br> A %Bid volume ratio of 50% indicates the supply and demand of a stock, as well as interest in a stock between buyers and sellers, is at an equilibrium. When this ratio exceeds 70%, investors are signaling a bullish sentiment on the stock. On the contrary, when it falls below 30%, investors are showing bearish signs on the stock."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "activeBuyPercentage",
            "lang": {
              "vi": "% Mua CĐ",
              "en": "% Buy Up"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "%",
            "lang": {
              "vi": "%",
              "en": "%"
            }
          },
          "tooltip": {
            "vi": "Là tỷ lệ của Tổng khối lượng tích lũy từ đầu ngày giao dịch của các lệnh Mua chủ động / (Tổng khối lượng tích lũy từ đầu ngày giao dịch của các lệnh Mua chủ động + Tổng khối lượng tích lũy từ đầu ngày giao dịch của các lệnh Bán chủ động). Tính theo %. <br>Giá chứng khoán dịch chuyển tăng là do khối lượng mua lên nhiều hơn khối lượng bán xuống và ngược lại, giá dịch chuyển giảm là do khối lượng bán xuống nhiều hơn khối lượng mua lên. Do đó, tỷ lệ Cung cầu tại 50% là mốc cân bằng. Tỷ lệ này cao hơn 70% thể hiện trạng thái hưng phấn của nhà đầu tư; còn dưới 30% lại thể hiện trạng thái bi quan của nhà đầu tư.",
            "en": "%Active buy shows the ratio of the Total accumulated active purchase orders since the opening of the market / (Total accumulated active purchase orders since the opening of the market + Total accumulated active sell orders since the opening of the market), being expressed in percentage. %Active buy helps to explain the force behind the movement of a stock’s price. When more people want to buy a stock (demand) than sell a stock (supply), the price is more likely to move up; conversely, if the majority of investors are selling more than buying, a stock is subsequently prone to tumble. <br>Thus, a %Active buy ratio of 50% shows an equilibrium of supply and demand in the market. When the ratio exceeds 70%, investors are being bullish. Conversely, when the ratio goes below 30%, investors are being bearish."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "foreignTransaction",
            "lang": {
              "vi": "GD khối ngoại",
              "en": "Net foreign transaction"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "buyMoreThanSell",
              "lang": {
                "vi": "Mua ròng",
                "en": "Net buy"
              }
            },
            {
              "data": "buyLessThanSell",
              "lang": {
                "vi": "Bán ròng",
                "en": "Net sell"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Là tiêu chí lọc cổ phiếu theo trạng thái (mua ròng/bán ròng) của nhà đầu tư nước ngoài. Ở một số cổ phiếu, diễn biến giao dịch nhà đầu tư nước ngoài đóng vai trò dẫn dắt đà tăng giá/giảm giá của cổ phiếu đó. Do vậy, chiến lược giao dịch theo trạng thái mua/bán của nhà đầu tư nước ngoài cũng là một sự lựa chọn cho nhà đầu tư.",
            "en": "This filter indicates the net buying/selling status of foreign investors' trades. For some stocks, foreign investors' trades play a leading role in the price changes. Therefore, following the net buying/selling status of foreign investors' trades can be an investment strategy."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "foreignBuySell20Session",
            "lang": {
              "vi": "GD khối ngoại 20 phiên",
              "en": "20-days foreign trade"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": {
            "data": "thousand",
            "lang": {
              "vi": "nghìn",
              "en": "thousand"
            }
          },
          "tooltip": {
            "vi": "Là tiêu chí lọc cổ phiếu theo tổng giá trị mua ròng/bán ròng của nhà đầu tư nước ngoài trong 20 phiên gần nhất. Ở một số cổ phiếu, diễn biến giao dịch nhà đầu tư nước ngoài đóng vai trò dẫn dắt đà tăng giá/giảm giá của cổ phiếu đó. Do vậy, chiến lược giao dịch theo trạng thái mua/bán của nhà đầu tư nước ngoài cũng là một sự lựa chọn cho nhà đầu tư.",
            "en": "This indicator shows the total net buying/selling value of foreign investors' trades within the most recent 20 days. For some stocks, foreign investors' trades play a leading role in the price changes. Therefore, following the total net buying/selling value of foreign investors' trades can be an investment strategy."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IS_NUMBER",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "numIncreaseContinuousDay",
            "lang": {
              "vi": "Phiên tăng liên tiếp",
              "en": "Consecutive price increases"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này giúp xác định những cổ phiếu có số phiên tăng liên tiếp tính đến thời điểm hiện tại. Nhà đầu tư (NĐT) có thể sử dụng chỉ tiêu này để lọc ra những cổ phiếu đang bước vào xu hướng tăng. <br>Theo đó, những cổ phiếu có chuỗi tăng giá vượt trội thị trường chung có khả năng chống chọi được với những ảnh hưởng tiêu cực và tạo điều kiện thuận lợi cho việc nắm giữ lâu dài. Về cách sử dụng, NĐT có thể tìm kiếm những cổ phiếu có chuỗi 3-5 phiên tăng liên tiếp, cùng tỷ lệ % tăng giá cao (ví dụ: >10%) trong 1 tuần trở lại đây hoặc có tỷ lệ % tăng giá lớn hơn % tăng của VN-Index trong tuần. Khi lọc tiêu chí này, càng nhiều cổ phiếu có chuỗi tăng giá liên tiếp thể hiện tâm lý thị trường càng hưng phấn.",
            "en": "This indicator helps investors select stocks based on the number of consecutive price increases at the present. Investors can use this indicator to filter for stocks that are entering an uptrend. <br>Accordingly, stocks with more consecutive price increases than the market average might better withstand negative market conditions and thus are more suitable for long-term holding. For example, investors can look for stocks that have increased for 3-5 consecutive trading days, with a high percentage increase (e.g. >10%) or a higher percentage increase than VN-Index within the past week. When applying this criteria, a high number of stocks with consecutive price increases indicates bullish market sentiment."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "numDecreaseContinuousDay",
            "lang": {
              "vi": "Phiên giảm liên tiếp",
              "en": "Consecutive price decreases"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này giúp xác định những cổ phiếu có số phiên giảm liên tiếp tính đến thời điểm hiện tại. Nhà đầu tư (NĐT) có thể sử dụng chỉ tiêu này để lọc ra những cổ phiếu đang trong xu hướng giảm mạnh, nhờ đó, NĐT có thể tìm kiếm những cơ hội \"bắt đáy\" - những cổ phiếu đã điều chỉnh về vùng giá hấp dẫn. <br> Về cách sử dụng, NĐT có thể lọc những cổ phiếu có chuỗi 3-5 phiên giảm liên tiếp, cùng tỷ lệ giảm giá cao (ví dụ: >15%) trong 1 tuần trở lại đây để giải ngân với tỷ trọng vừa phải. Khi lọc tiêu chí này, càng nhiều cổ phiếu có chuỗi giảm giá liên tiếp thể hiện tâm lý thị trường càng bi quan.",
            "en": "This indicator helps investors select stocks based on the number of consecutive price decreases at the present. Investors can use this indicator to filter for stocks are on strong downtrends, in order to identify \"bottom-fishing\" opportunities - stocks that have been corrected to attractive price ranges. <br>For example, investors can look for stocks that have decreased for 3-5 consecutive trading days, with a high percentage decrease (e.g. >15%) within the past week to take a position with moderate amount. When applying this criteria, a high number of stocks with consecutive price decreases indicates bearish market sentiment."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0",
          "type": "technical",
          "index": 0,
          "display": "chart"
        }
      ]
    },
    {
      "type": {
        "vi": "Tín hiệu kỹ thuật",
        "en": "Technical signal"
      },
      "items": [
        {
          "key": {
            "data": "rsi14",
            "lang": {
              "vi": "RSI (14)",
              "en": "RSI (14)"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "RSI(14) là viết tắt của từ Relative Strength Index - Chỉ báo sức mạnh tương đối - cho 14 điểm thời gian (ví dụ: 14 ngày, 14 tuần,....). <br>RSI cho biết bên mua hay bên bán đang chiếm ưu thế trên thị trường. Giá trị của RSI dao động từ 0 đến 100. RSI tăng trên 70 cho thấy thị trường đang mua mạnh cổ phiếu này. Tương tự khi RSI giảm xuống dưới 30 cho thấy  thị trường đang bán mạnh cổ phiếu này.",
            "en": "The Relative Strength Index (RSI) is calculated for 14 points of time (e.g: 14 days, 14 weeks,...). <br>RSI determines whether buyers or sellers are dominating in the market. The RSI value ranges from 0 to 100.  The RSI value over 70 indicates that the market is strongly buying this stock. Similarly, the RSI falls below 30 indicates that the market is strongly selling this stock."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0LOE100",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "rsi14Status",
            "lang": {
              "vi": "Trạng thái RSI(14)",
              "en": "RSI(14) Status"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "intoOverBought",
              "lang": {
                "vi": "Vào vùng quá mua",
                "en": "Into Overbought Territory"
              }
            },
            {
              "data": "outOfOverBought",
              "lang": {
                "vi": "Thoát vùng quá mua",
                "en": "Out of Overbought Territory"
              }
            },
            {
              "data": "intoOverSold",
              "lang": {
                "vi": "Vào vùng quá bán",
                "en": "Into Oversold Territory"
              }
            },
            {
              "data": "outOfOverSold",
              "lang": {
                "vi": "Thoát vùng quá bán",
                "en": "Out of Oversold Territory"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "RSI(14) là viết tắt của từ Relative Strength Index - Chỉ báo sức mạnh tương đối - cho 14 điểm thời gian (ví dụ: 14 ngày, 14 tuần,....). RSI cho biết bên mua hay bên bán đang chiếm ưu thế trên thị trường. Giá trị của RSI dao động từ 0 đến 100. Có 4 trạng thái cần lưu ý đối với RSI(14): <br>(1) RSI tiến vào vùng quá mua: Được xác định khi RSI cắt từ dưới lên trên mốc 70 - cho thấy thị trường đang mua mạnh cổ phiếu này. <br>(2) RSI thoát khỏi vùng quá mua: Được xác định khi RSI cắt từ trên xuống dưới mốc 70 - cho thấy xu hướng tăng giá của cổ phiếu đang dần suy yếu. Nhà đầu tư có thể cân nhắc bán cổ phiếu <br>(3) RSI tiến vào vùng quá bán: Được xác định khi RSI cắt từ trên xuống dưới mốc 30 - cho thấy thị trường đang bán mạnh cổ phiếu này. <br>(4) RSI thoát khỏi vùng quá bán: Được xác định khi RSI cắt từ dưới lên trên mốc 30 - cho thấy xu hướng giảm giá của cổ phiếu đang dần suy yếu. Nhà đầu tư có thể cân nhắc mua \"bắt đáy\" với tỷ trọng thấp.",
            "en": "RSI(14) stands for the Relative Strength Index over 14 points of time (for example 14 days, 14 weeks, ....). The RSI indicates whether buyers or sellers are dominating the market. RSI values range from 0 to 100. There are 4 status of the RSI(14) that investors need to consider: <br>(1) The RSI entering the overbought area: The RSI crosses above 70, which means the market is strongly buying the stock. <br>(2) The RSI exiting the overbought area: The RSI crosses below 70, which means the uptrend is weakening. Investors might consider selling the stock. <br>(3) The RSI entering the oversold area: The RSI crosses below 30, which means the market is strongly selling the stock. <br>(4) The RSI exiting the oversold area: The RSI crosses above 30, which means the downtrend is weakening. Investors might consider bottom-fishing by buying the stock with a moderate position."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "tcbsBuySellSignal",
            "lang": {
              "vi": "Tín hiệu kỹ thuật",
              "en": "TCBS's technical signals"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "BUY",
              "lang": {
                "vi": "Mua",
                "en": "Buy"
              }
            },
            {
              "data": "STRONG_BUY",
              "lang": {
                "vi": "Mua mạnh",
                "en": "Strong buy"
              }
            },
            {
              "data": "NEUTRAL",
              "lang": {
                "vi": "Trung tính",
                "en": "Neutral"
              }
            },
            {
              "data": "SELL",
              "lang": {
                "vi": "Bán",
                "en": "Sell"
              }
            },
            {
              "data": "STRONG_SELL",
              "lang": {
                "vi": "Bán mạnh",
                "en": "Strong sell"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này giúp nhà đầu tư chọn lọc cổ phiếu dựa trên các tín hiệu kỹ thuật MUA MẠNH, MUA, TRUNG TÍNH, BÁN, BÁN MẠNH của TCBS. Ý nghĩa cụ thể của các tín hiệu này như sau: <br>- MUA MẠNH: Mọi chỉ báo kỹ thuật của cổ phiếu đều vượt trội, thị trường đang mua rất mạnh cổ phiếu. Nhà đầu tư nên xem xét dư địa tăng trưởng trong ngắn hạn và cân nhắc chốt lời một phần nếu cần thiết. <br>- MUA: Thị trường đang mua mạnh cổ phiếu. Trạng thái này thể hiện dòng tiền đang có xu hướng dịch chuyển vào cổ phiếu, nhà đầu tư có thể cân nhắc mua mới hoặc gia tăng tỷ trọng. <br>- TRUNG TÍNH: Thị trường đang có góc nhìn trung lập về cổ phiếu. Các tín hiệu kỹ thuật không rõ ràng, vì vậy nhà đầu tư có thể theo dõi thêm trước khi ra quyết định mua bán. <br>- BÁN: Thị trường đang bán mạnh cổ phiếu. Trạng thái này thể hiện dòng tiền đang có xu hướng dịch chuyển ra khỏi cổ phiếu, nhà đầu tư có thể xem xét giảm tỷ trọng. <br>- BÁN MẠNH: Thị trường đang bán rất mạnh cổ phiếu. Nhà đầu tư có thể theo dõi tín hiệu kỹ thuật đảo chiều để tìm kiếm cơ hội \"bắt đáy\"",
            "en": "This indicator helps investors select stocks based on technical signals such as STRONG BUY, BUY, NEUTRAL, SELL, STRONG SELL from TCBS's analysts. The meaning of these recommendations are as follows: <br>- STRONG BUY: Technical indicators show that the stock is outperforming and that the market is strongly buying the stock. Investors should assess its remaining short-term upside and consider taking profits if necessary. <br>- BUY: The market is strongly buying the stock. This status indicates that money flows are moving into the stock, and investors should consider opening a buy position or increasing the existing position. <br>- NEUTRAL: The market has a neutral view on the stock. Technical signals are unclear, so investors should continue monitoring the stock before making buying/selling decisions. <br>- SELL: The market is strongly selling the stock. This status indicates that money flows are moving out of the stock, and investors should consider decreasing partly of the current position. <br>- STRONG SELL: The market is strongly selling the stock. Investors should look for signals of reversal to identify \"bottom-fishing\" opportunities."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "priceBreakOut52Week",
            "lang": {
              "vi": "Vượt đỉnh 52 tuần",
              "en": "Breaching 52-week high"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "BREAK_OUT",
              "lang": {
                "vi": "Tín hiệu vượt đỉnh",
                "en": "52-week High Breakout"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này giúp phát hiện những cổ phiếu đã vượt đỉnh 52 tuần - tức là giá hiện tại của cổ phiếu đó đang cao hơn giá đóng cửa của tất cả phiên giao dịch trong một năm trở lại đây. Đỉnh giá 52 tuần đóng vai trò một ngưỡng kháng cự mạnh và quan trọng. Khi một cổ phiếu vượt đỉnh 52 tuần, đà tăng của cổ phiếu được duy trì mạnh hơn, cổ phiếu có xu hướng lập đỉnh cao hơn nữa. Do đó, nhà đầu tư có thể cân nhắc mua khi cổ phiếu vượt đỉnh 52 tuần, đi kèm với đó là khối lượng giao dịch đột biến (cao hơn 50% khối lượng giao dịch trung bình 20 phiên gần nhất).",
            "en": "This indicator helps investors identify stocks that have broken their 52-week highs, which means that the current stock price is higher than the closing prices of all trading days within the last year. The 52-week high acts as a strong and an important resistance level. When a stock breaks its 52-week high, its momentum is strengthened and the stock tends to establish a new high. Therefore, investors might consider buying when the stock breaks its 52-week high, accompanied by a sharp increase in volume (50% higher than the average trading volume within the past 20 trading days)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "EQUAL",
          "type": "technical",
          "index": 0,
          "display": "fix"
        },
        {
          "key": {
            "data": "priceWashOut52Week",
            "lang": {
              "vi": "Phá đáy 52 tuần",
              "en": "Breaching 52-week low"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "WASH_OUT",
              "lang": {
                "vi": "Tín hiệu thủng đáy",
                "en": "52-week Low Breakout"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Chỉ tiêu này giúp phát hiện những cổ phiếu đã phá vỡ đáy 52 tuần - tức là giá hiện tại của cổ phiếu đó đang thấp hơn giá đóng cửa của tất cả phiên giao dịch trong một năm trở lại đây. Đáy 52 tuần đóng vai trò một ngưỡng hỗ trợ mạnh và quan trọng. Khi một cổ phiếu phá vỡ đáy 52 tuần, nó có thể kích hoạt đà bán tháo của nhà đầu tư, cổ phiếu có xu hướng tiếp tục giảm mạnh. Do đó, nhà đầu tư nên cân nhắc bán cổ phiếu khi giá phá vỡ đáy 52 tuần, đi kèm với đó là khối lượng giao dịch đột biến (cao hơn 50% khối lượng giao dịch trung bình 20 phiên gần nhất)",
            "en": "This indicator helps investors identify stocks that have broken their 52-week lows, which means that the current stock price is lower than the closing prices of all trading days within the last year. The 52-week low acts as a strong and important support level. When a stock breaks its 52-week low, it can trigger a wave of panic selling and the stock price tends to continue steeply declining. Therefore, investors might consider selling when the stock breaks its 52-week low, accompanied by a sharp increase in volume (50% higher than the average trading volume within the past 20 trading days)."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "EQUAL",
          "type": "technical",
          "index": 0,
          "display": "fix"
        },
        {
          "key": {
            "data": "macdHistogram",
            "lang": {
              "vi": "MACD Histogram",
              "en": "MACD Histogram"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "macdHistGT0Increase",
              "lang": {
                "vi": "MACD Histogram > 0 và tăng dần",
                "en": "MACD Histogram > 0 and increase"
              }
            },
            {
              "data": "macdHistGT0Decrease",
              "lang": {
                "vi": "MACD Histogram > 0 và giảm dần",
                "en": "MACD Histogram > 0 and decrease"
              }
            },
            {
              "data": "macdHistLT0Increase",
              "lang": {
                "vi": "MACD Histogram < 0 và tăng dần",
                "en": "MACD Histogram < 0 and increase"
              }
            },
            {
              "data": "macdHistLT0Decrease",
              "lang": {
                "vi": "MACD Histogram <0 và giảm dần",
                "en": "MACD Histogram <0 and decrease"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "MACD Histogram được tính bằng chênh lệch của đường MACD và đường Tín hiệu. Chênh lệch càng lớn thì giá trị càng cao. Giá trị MACD Histogram lớn hơn 0 và tăng dần cho thấy lực mua đang áp đảo lực bán, nhà đầu tư có thể cân nhắc giải ngân cổ phiếu. Ngược lại, giá trị MACD Histogram nhỏ hơn 0 và giảm dần cho thấy lực bán đang áp đảo lực mua, nhà đầu tư có thể cân nhắc thoát vị thế cổ phiếu.",
            "en": "The MACD Histogram is the difference between the MACD line and the Signal line. A high difference indicates a high value. A MACD Histogram with value greater than 0 and continuous increase indicates that the buy side is stronger than the sell side, and investors might consider buying the stock. On the other hand, a MACD Histogram with value less than 0 and continuous decrease indicates that the sell side is stronger than the buy side, and investors might consider selling the stock."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "relativeStrength3Day",
            "lang": {
              "vi": "RS 3 ngày",
              "en": "3-days RS"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là một phương pháp giúp nhà đầu tư sàng lọc ra các cổ phiếu đang có xu hướng tăng mạnh. Tại TCBS, chúng tôi đo lường sức mạnh giá của khoảng 500 cổ phiếu niêm yết có vốn hóa lớn nhất thị trường bằng cách so sánh sự thay đổi giá của một cổ phiếu với số cổ phiếu còn lại cho khung thời gian 3 ngày và xếp hạng từ 1 đến 100. <br>Ví dụ, một cổ phiếu có chỉ số Sức mạnh giá ở mức 90 nghĩa là cổ phiếu có mức độ tăng giá trong 3 ngày gần nhất hơn 90% các cổ phiếu còn lại trên thị trường. Theo đó, nếu một số cổ phiếu có điểm chỉ số Sức mạnh chỉ ở mức 20, 30 sẽ được coi là có Sức mạnh giá ở mức thấp hay yếu, nhưng khi được nhà đầu tư chú ý và có dòng tiền đổ vào, chỉ số này sẽ tăng dần lên và có thể ở mức cao trên 60 hay 70 điểm. Những cổ phiếu đạt mức 80 điểm trở lên được chúng tôi xem là những cổ phiếu có sức mạnh giá cao. <br>Trên thế giới việc sử dụng chỉ số Sức mạnh giá hay tên tiếng Anh là Relative Strength (RS) rất phổ biến trong việc tìm kiếm cổ phiếu tiềm năng. Nhà đầu tư lừng danh William O’Neil với phương pháp đầu tư CANSLIM nổi tiếng đã sử dụng công cụ này để tìm ra các cổ phiếu dẫn đầu (Leader). Đó là các cổ phiếu đáp ứng chữ “L” trong mô hình lựa chọn cổ phiếu CANSLIM.",
            "en": "This is a method to help investors identify stocks in strong uptrend. At TCBS, we measure the relative price strength of stocks of ~500 largest listed companies by market cap by comparing the price changes of each stock with the rest over 3 days and rank them from 1 to 100. <br>For example, a stock with relative strength score of 90 would have a stronger uptrend in the last 3 days than 90% of the market. According to the calculation, stocks with relative strength scores of only 20 - 30 are considered to have low or weak price strength; however, once they start attracting investors and large money inflows, this number might gradually increase and exceed 60 - 70 points. Stocks with 80 points or more are considered to have high relative price strength. <br>In practice, relative strength (RS), is widely used to find potential stocks. Celebrated investor William O’Neil, who invented the famous CANSLIM investment methodology, used this tool to identify leading stocks (Leaders). These are stocks that satisfy the “L” criterion."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0LOE100",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "relativeStrength1Month",
            "lang": {
              "vi": "RS 1 tháng",
              "en": "1-month RS"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là một phương pháp giúp nhà đầu tư sàng lọc ra các cổ phiếu đang có xu hướng tăng mạnh. Tại TCBS, chúng tôi đo lường sức mạnh giá của khoảng 500 cổ phiếu niêm yết có vốn hóa lớn nhất thị trường bằng cách so sánh sự thay đổi giá của một cổ phiếu với số cổ phiếu còn lại cho khung thời gian 1 tháng và xếp hạng từ 1 đến 100. <br>Ví dụ, một cổ phiếu có chỉ số Sức mạnh giá ở mức 90 nghĩa là cổ phiếu có mức độ tăng giá trong 1 tháng gần nhất mạnh hơn 90% các cổ phiếu còn lại trên thị trường. Theo đó, nếu một số cổ phiếu có điểm chỉ số Sức mạnh chỉ ở mức 20, 30 sẽ được coi là có Sức mạnh giá ở mức thấp hay yếu, nhưng khi được nhà đầu tư chú ý và có dòng tiền đổ vào, chỉ số này sẽ tăng dần lên và có thể ở mức cao trên 60 hay 70 điểm. Những cổ phiếu đạt mức 80 điểm trở lên được chúng tôi xem là những cổ phiếu có sức mạnh giá cao. <br>Trên thế giới việc sử dụng chỉ số Sức mạnh giá hay tên tiếng Anh là Relative Strength (RS) rất phổ biến trong việc tìm kiếm cổ phiếu tiềm năng. Nhà đầu tư lừng danh William O’Neil với phương pháp đầu tư CANSLIM nổi tiếng đã sử dụng công cụ này để tìm ra các cổ phiếu dẫn đầu (Leader). Đó là các cổ phiếu đáp ứng chữ “L” trong mô hình lựa chọn cổ phiếu CANSLIM.",
            "en": "This is a method to help investors identify stocks in strong uptrend. At TCBS, we measure the relative price strength of stocks of ~500 largest listed companies by market cap by comparing the price changes of each stock with the rest over 1 month and rank them from 1 to 100. <br>For example, a stock with relative strength score of 90 would have a stronger uptrend in the last 1 month than 90% of the market. According to the calculation, stocks with relative strength scores of only 20 - 30 are considered to have low or weak price strength; however, once they start attracting investors and large money inflows, this number might gradually increase and exceed 60 - 70 points. Stocks with 80 points or more are considered to have high relative price strength. <br>In practice, relative strength (RS), is widely used to find potential stocks. Celebrated investor William O’Neil, who invented the famous CANSLIM investment methodology, used this tool to identify leading stocks (Leaders). These are stocks that satisfy the “L” criterion."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0LOE100",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "relativeStrength3Month",
            "lang": {
              "vi": "RS 3 tháng",
              "en": "3-months RS"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là một phương pháp giúp nhà đầu tư sàng lọc ra các cổ phiếu đang có xu hướng tăng mạnh. Tại TCBS, chúng tôi đo lường sức mạnh giá của khoảng 500 cổ phiếu niêm yết có vốn hóa lớn nhất thị trường bằng cách so sánh sự thay đổi giá của một cổ phiếu với số cổ phiếu còn lại cho khung thời gian 3 tháng và xếp hạng từ 1 đến 100. <br>Ví dụ, một cổ phiếu có chỉ số Sức mạnh giá ở mức 90 nghĩa là cổ phiếu có mức độ tăng giá trong 3 tháng gần nhất mạnh hơn 90% các cổ phiếu còn lại trên thị trường. Theo đó, nếu một số cổ phiếu có điểm chỉ số Sức mạnh chỉ ở mức 20, 30 sẽ được coi là có Sức mạnh giá ở mức thấp hay yếu, nhưng khi được nhà đầu tư chú ý và có dòng tiền đổ vào, chỉ số này sẽ tăng dần lên và có thể ở mức cao trên 60 hay 70 điểm. Những cổ phiếu đạt mức 80 điểm trở lên được chúng tôi xem là những cổ phiếu có sức mạnh giá cao. <br>Trên thế giới việc sử dụng chỉ số Sức mạnh giá hay tên tiếng Anh là Relative Strength (RS) rất phổ biến trong việc tìm kiếm cổ phiếu tiềm năng. Nhà đầu tư lừng danh William O’Neil với phương pháp đầu tư CANSLIM nổi tiếng đã sử dụng công cụ này để tìm ra các cổ phiếu dẫn đầu (Leader). Đó là các cổ phiếu đáp ứng chữ “L” trong mô hình lựa chọn cổ phiếu CANSLIM.",
            "en": "This is a method to help investors identify stocks in strong uptrend. At TCBS, we measure the relative price strength of stocks of ~500 largest listed companies by market cap by comparing the price changes of each stock with the rest over 3 months and rank them from 1 to 100. <br>For example, a stock with relative strength score of 90 would have a stronger uptrend in the last 3 months than 90% of the market. According to the calculation, stocks with relative strength scores of only 20 - 30 are considered to have low or weak price strength; however, once they start attracting investors and large money inflows, this number might gradually increase and exceed 60 - 70 points. Stocks with 80 points or more are considered to have high relative price strength. <br>In practice, relative strength (RS), is widely used to find potential stocks. Celebrated investor William O’Neil, who invented the famous CANSLIM investment methodology, used this tool to identify leading stocks (Leaders). These are stocks that satisfy the “L” criterion."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0LOE100",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "relativeStrength1Year",
            "lang": {
              "vi": "RS 1 năm",
              "en": "1-years RS"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là một phương pháp giúp nhà đầu tư sàng lọc ra các cổ phiếu đang có xu hướng tăng mạnh. Tại TCBS, chúng tôi đo lường sức mạnh giá của khoảng 500 cổ phiếu niêm yết có vốn hóa lớn nhất thị trường bằng cách so sánh sự thay đổi giá của một cổ phiếu với số cổ phiếu còn lại cho khung thời gian 1 năm và xếp hạng từ 1 đến 100. <br>Ví dụ, một cổ phiếu có chỉ số Sức mạnh giá ở mức 90 nghĩa là cổ phiếu có mức độ tăng giá trong 1 năm gần nhất mạnh hơn 90% các cổ phiếu còn lại trên thị trường. <br>Theo đó, nếu một số cổ phiếu có điểm chỉ số Sức mạnh chỉ ở mức 20, 30 sẽ được coi là có Sức mạnh giá ở mức thấp hay yếu, nhưng khi được nhà đầu tư chú ý và có dòng tiền đổ vào, chỉ số này sẽ tăng dần lên và có thể ở mức cao trên 60 hay 70 điểm. Những cổ phiếu đạt mức 80 điểm trở lên được chúng tôi xem là những cổ phiếu có sức mạnh giá cao. Trên thế giới việc sử dụng chỉ số Sức mạnh giá hay tên tiếng Anh là Relative Strength (RS) rất phổ biến trong việc tìm kiếm cổ phiếu tiềm năng. Nhà đầu tư lừng danh William O’Neil với phương pháp đầu tư CANSLIM nổi tiếng đã sử dụng công cụ này để tìm ra các cổ phiếu dẫn đầu (Leader). Đó là các cổ phiếu đáp ứng chữ “L” trong mô hình lựa chọn cổ phiếu CANSLIM.",
            "en": "This is a method to help investors identify stocks in strong uptrend. At TCBS, we measure the relative price strength of stocks of ~500 largest listed companies by market cap by comparing the price changes of each stock with the rest over 1 year and rank them from 1 to 100. <br>For example, a stock with relative strength score of 90 would have a stronger uptrend in the last 1 year than 90% of the market. <br>According to the calculation, stocks with relative strength scores of only 20 - 30 are considered to have low or weak price strength; however, once they start attracting investors and large money inflows, this number might gradually increase and exceed 60 - 70 points. Stocks with 80 points or more are considered to have high relative price strength. In practice, relative strength (RS), is widely used to find potential stocks. Celebrated investor William O’Neil, who invented the famous CANSLIM investment methodology, used this tool to identify leading stocks (Leaders). These are stocks that satisfy the “L” criterion."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0LOE100",
          "type": "technical",
          "index": 0,
          "display": "chart"
        },
        {
          "key": {
            "data": "tcRS",
            "lang": {
              "vi": "RS trung bình",
              "en": "Average RS"
            }
          },
          "operator": [
            ">=",
            "<=",
            ">",
            "<",
            "="
          ],
          "value": null,
          "unit": null,
          "tooltip": {
            "vi": "Là một phương pháp giúp nhà đầu tư sàng lọc ra các cổ phiếu đang có xu hướng tăng mạnh. <br> Tại TCBS, chúng tôi đo lường sức mạnh giá của khoảng 500 cổ phiếu niêm yết có vốn hóa lớn nhất thị trường bằng cách so sánh sự thay đổi giá của một cổ phiếu với số cổ phiếu còn lại cho 4 khung thời gian là 3 ngày, 1 tháng, 3 tháng và 1 năm. Kết quả của 4 khung thời gian kể trên được xếp hạng từ 1 đến 100 và sau đó lấy trung bình cộng để đưa ra một giá trị cuối cùng. Ví dụ, một cổ phiếu có chỉ số Sức mạnh giá ở mức 90 nghĩa là cổ phiếu có mức độ tăng giá trong quá khứ mạnh hơn 90% các cổ phiếu còn lại trên thị trường <br>Theo đó, nếu một số cổ phiếu có điểm chỉ số Sức mạnh chỉ ở mức 20, 30 sẽ được coi là có Sức mạnh giá ở mức thấp hay yếu, nhưng khi được nhà đầu tư chú ý và có dòng tiền đổ vào, chỉ số này sẽ tăng dần lên và có thể ở mức cao trên 60 hay 70 điểm. Những cổ phiếu đạt mức 80 điểm trở lên được chúng tôi xem là những cổ phiếu có sức mạnh giá cao. <br>Trên thế giới việc sử dụng chỉ số Sức mạnh giá hay tên tiếng Anh là Relative Strength (RS) rất phổ biến trong việc tìm kiếm cổ phiếu tiềm năng. Nhà đầu tư lừng danh William O’Neil với phương pháp đầu tư CANSLIM nổi tiếng đã sử dụng công cụ này để tìm ra các cổ phiếu dẫn đầu (Leader). Đó là các cổ phiếu đáp ứng chữ “L” trong mô hình lựa chọn cổ phiếu CANSLIM.",
            "en": "This is a method to help investors identify stocks in strong uptrend. <br>At TCBS, we measure the relative price strength of stocks of ~500 largest listed companies by market cap by comparing the price changes of each stock with the rest over 4 different time frames of 3 days, 1 month, 3 months and 1 year. Results from these 4 time frames are ranked from 1 to 100 and then averaged to produce a final score. For example, a stock with relative strength score of 90 would have a stronger uptrend than 90% of the market, historically. <br> According to the calculation, stocks with relative strength scores of only 20 - 30 are considered to have low or weak price strength; however, once they start attracting investors and large money inflows, this number might gradually increase and exceed 60 - 70 points. Stocks with 80 points or more are considered to have high relative price strength. <br>In practice, relative strength (RS), is widely used to find potential stocks. Celebrated investor William O’Neil, who invented the famous CANSLIM investment methodology, used this tool to identify leading stocks (Leaders). These are stocks that satisfy the “L” criterion."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "GOE0LOE100",
          "type": "technical",
          "index": 0,
          "display": "chart"
        }
      ]
    },
    {
      "type": {
        "vi": "Tín hiệu mua/bán",
        "en": "Buy/Sell signal"
      },
      "items": [
        {
          "key": {
            "data": "sarVsMacdHist",
            "lang": {
              "vi": "SAR x MACD Histogram",
              "en": "SAR x MACD Histogram"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "BUY",
              "lang": {
                "vi": "Tín hiệu mua",
                "en": "Buy signal"
              }
            },
            {
              "data": "SELL",
              "lang": {
                "vi": "Tín hiệu bán",
                "en": "Sell signal"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Bộ lọc này kết hợp chỉ báo SAR (Stop And Reverse) và chỉ báo MACD Histogram. Cụ thể, chỉ báo SAR nằm dưới giá đóng cửa của cổ phiếu cho tín hiệu tăng giá. Ngoài ra, MACD Histogram chuyển từ âm sang dương (đồng nghĩa với việc đường MACD cắt từ dưới lên trên đường Signal) thể hiện xu hướng tăng đang dần được hình thành. Do đó, nhà đầu tư có thể cân nhắc mua khi cổ phiếu thỏa mãn 2 điều kiện này. <br>Tương tự, chỉ báo SAR nằm trên giá đóng cửa của cổ phiếu cho tín hiệu giảm giá. Ngoài ra, MACD Histogram chuyển từ dương sang âm (đồng nghĩa với việc đường MACD cắt từ trên xuống dưới đường Signal), thể hiện xu hướng giảm đang dần được hình thành. Do đó, nhà đầu tư có thể cân nhắc bán khi cổ phiếu thỏa mãn 2 điều kiện này.",
            "en": "This filter combines the SAR (Stop And Reverse) and MACD Histogram indicators. Specifically, if the SAR indicator is below the closing price of a stock, it is a bullish signal. Additionally, if the MACD Histogram turns from negative to positive (the MACD line crosses above the signal line), an uptrend is gradually developing. Therefore, investors might consider buying when the stock satisfies these 2 conditions. <br>On the other hand, if the SAR indicator is above the closing price of a stock, it is a bearish signal. Additionally, if the MACD Histogram turns from positive to negative (the MACD line crosses below the signal line), a downtrend is gradually creating. Therefore, investors might consider selling when the stock satisfies these 2 conditions."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "bollingBandSignal",
            "lang": {
              "vi": "Mở Band Bollinger ",
              "en": "Expanding Bollinger Bands"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "BUY",
              "lang": {
                "vi": "Tín hiệu mua",
                "en": "Buy signal"
              }
            },
            {
              "data": "SELL",
              "lang": {
                "vi": "Tín hiệu bán",
                "en": "Sell signal"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Bộ lọc này sử dụng chỉ báo Bollinger Bands Width (BBW) kết hợp với đường trung bình 20 ngày (MA20) của cổ phiếu. Cụ thể, giá trị BBW càng nhỏ thể hiện biên độ giao dịch càng thu hẹp. BBW tạo đáy thể hiện biên độ giao dịch đang ở mức rất thấp, giá cổ phiếu đang được tích lũy chặt chẽ. Khi BBW tăng dần kết hợp với việc giá vượt đường MA20, cổ phiếu có thể bước vào một nhịp tăng mới. Do đó, nhà đầu tư có thể cân nhắc mua khi cổ phiếu thỏa mãn 2 điều kiện này. <br>Ngược lại, BBW tăng dần kết hợp với giá cắt xuống dưới đường MA20 hàm ý rằng cổ phiếu có thể bắt đầu một xu hướng giảm. Do đó, nhà đầu tư có thể cân nhắc bán khi cổ phiếu thỏa mãn 2 điều kiện này.",
            "en": "This filter combines the Bollinger Bands Width (BBW) and 20-day price moving average indicators. Specifically, a lower BBW value indicates that the fluctuation range is getting narrower. If the BBW establishes a new bottom, it means that the fluctuation range is extremely reduced, and the stock's price is steadily accumulated. When the BBW gradually increases, accompanied by the stock price crossing above the MA20 line, the stock might enter a new uptrend. Therefore, investors might consider buying when the stock satisfies these 2 conditions. <br>On the other hand, when the BBW gradually increases, accompanied by the stock price crossing below the MA20 line, the stock might enter a new downtrend. Therefore, investors might consider selling when the stock satisfies these 2 conditions."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "dmiSignal",
            "lang": {
              "vi": "Lướt sóng vs DMI",
              "en": "Trading with DMI"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "BUY",
              "lang": {
                "vi": "Tín hiệu mua",
                "en": "Buy signal"
              }
            },
            {
              "data": "SELL",
              "lang": {
                "vi": "Tín hiệu bán",
                "en": "Sell signal"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Bộ lọc này sử dụng chỉ báo Chuyển động Định hướng (Directional Movement Index - DMI) bao gồm đường ADX, DI+  và DI -. Trong đó, đường ADX có giá trị càng cao thể hiện xu hướng càng mạnh. Đường DI+ thể hiện xu hướng tăng của cổ phiếu và đường DI- thể hiện xu hướng giảm của cổ phiếu. Đường DI+ cắt từ dưới lên trên đường DI- hàm ý rằng ở thời điểm hiện tại, xu hướng tăng đang áp đảo xu hướng giảm của cổ phiếu. <br>Do đó, nhà đầu tư có thể cân nhắc mua khi cổ phiếu thỏa mãn 2 điều kiện: (1) đường ADX lên trên mốc 25 và (2) đường DI+ cắt từ dưới lên trên đường DI- <br>Tương tự, đường DI- cắt từ trên xuống dưới đường DI+ cho thấy ở thời điểm hiện tại, xu hướng giảm đang áp đảo xu hướng tăng của cổ phiếu. Do đó, nhà đầu tư có thể cân nhắc bán khi cổ phiếu thỏa mãn 2 điều kiện: (1) đường ADX cắt lên trên mốc 25 và (2) đường DI- cắt từ trên xuống dưới đường DI+",
            "en": "This filter uses the Directional Movement Index (DMI), including the ADX, DI+ and DI- lines. A higher ADX value indicates a stronger trend. The DI+ line shows the upward momentum of the stock, while the DI- line shows the downward momentum. The DI+ line crossing above the DI- line means that at the present, the upward momentum is stronger than the downward momentum. Therefore, investors might consider buying when the stock satisfies 2 conditions: (1) the ADX is greater than 25 and (2) the DI+ line crosses above the DI- line. <br>On the other hand, the DI- line crossing above the DI+ line means that at the present, the downward momentum is stronger than the upward momentum. Therefore, investors might consider selling when the stock satisfies 2 conditions: (1) the ADX is greater than 25 and (2) the DI- line crosses above the DI+ line."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "uptrend",
            "lang": {
              "vi": "Uptrend",
              "en": "Uptrend"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "buy-signal",
              "lang": {
                "vi": "Tín hiệu đầu tư mua",
                "en": "Buy signal"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Hệ thống giao dịch này kết hợp 3 đường trung bình di động (MA): MA5, MA10 và MA20. Khi các đường MA ngắn vượt lên trên các đường MA dài hơn cho thấy xu hướng tăng đang dần được hình thành, cho phép nhà đầu tư tìm kiếm lợi nhuận giao dịch trong ngắn hạn. <br>Điểm tín hiệu đầu tư mua xuất hiện tại những điểm thỏa mãn đồng thời 2 điều kiện: <br>(1) Đường MA10 đang nằm trên đường MA20. <br>(2) Đường MA5 vượt lên trên đường MA10.",
            "en": "This trading system uses a combination of 3 moving averages (MAs) - MA5, MA10 and MA20. When the MA5 - 10 - 20 are stacked above one another respectively, this signals the beginning of an uptrend and presents an opportunity to open positions for short-term trading. <br>A buy signal emerges when two conditions are satisfied simultaneously: <br>- MA10 is above MA20. <br>- MA5 crosses above MA10."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "EQUAL",
          "type": "technical",
          "index": 0,
          "display": "fix"
        },
        {
          "key": {
            "data": "breakout",
            "lang": {
              "vi": "Phá nền",
              "en": "Breakout"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "BULLISH",
              "lang": {
                "vi": "Tín hiệu mua",
                "en": "Buy Signal"
              }
            },
            {
              "data": "BEARISH",
              "lang": {
                "vi": "Tín hiệu bán",
                "en": "Sale Signal"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Giá cổ phiếu tạo nền tích lũy khi có một chuỗi những phiên giao dịch với biên độ hẹp. Khi cổ phiếu có một phiên giao dịch bùng nổ với sự biến động giá và khối lượng đột biến là lúc hình thành xu hướng mới của cổ phiếu. Tuy vào diễn biến giá tăng hoặc giảm sẽ xác định xu hướng trong tương lai. Điều kiện cần thỏa mãn gồm có: <br>Tín hiệu đầu tư mua xuất hiện khi thỏa mãn đồng thời: <br>(1) Giá cổ phiếu tích lũy tối thiểu 1 tháng trong biên độ hẹp không quá 10% <br>(2) Xuất hiện phiên phá vỡ nền tảng với giá tăng hơn 2% so với giá đóng cửa cao nhất của vùng tích lũy <br>(3) Khối lượng dự kiến ngày hiện tại gấp hơn 3 lần khối lượng trung bình 10 ngày gần nhất <br>Tín hiệu đầu tư bán xuất hiện khi thỏa mãn đồng thời: <br>(1) Giá cổ phiếu tích lũy tối thiểu 1 tháng trong biên độ hẹp không quá 10% <br>(2) Xuất hiện phiên phá vỡ nền tảng với giá giảm hơn 2% so với giá đóng cửa thấp nhất của vùng tích lũy <br>(3) Khối lượng dự kiến ngày hiện tại gấp hơn 3 lần khối lượng trung bình 10 ngày gần nhất",
            "en": "A breakout occurs when the price of a stock skyrockets, after having been contained between a resistance level and a support level.  A breakout session, if accompanied by larger-than-average volume, often sets a new trend for the stock. The direction the stock moves in that trading day will form the direction of the trend afterwards. The requirements for the signal include: <br>A breakout signals investors to buy when the following conditions are satisfied: <br>1) The stock has been trading in a contained range that is no larger than 10% within at least 1 month <br>2) A breakout session occurs – the stock’s price rises at least 2% from the previous highest closing price during the period when the stock was trading in a contained range <br>3) The estimated daily volume is at least 3 times the 10-day-average <br>A breakdown signals investors to sell when the following conditions are satisfied: <br>1) The stock has been trading in a contained range that is no larger than 10% within at least 1 month <br>2) A breakdown session occurs – the stock’s price falls at least 2% from the previous lowest closing price during the period when the stock was trading in a contained range <br>3) The estimated daily volume is at least 3 times the 10-day-average"
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        },
        {
          "key": {
            "data": "heatingUp",
            "lang": {
              "vi": "Tăng nóng",
              "en": "Overheated"
            }
          },
          "operator": [
            "="
          ],
          "value": [
            {
              "data": "HEATING_UP_PREV_SESSION",
              "lang": {
                "vi": "Tăng nóng phiên hôm trước",
                "en": "Previous trading session"
              }
            }
          ],
          "unit": null,
          "tooltip": {
            "vi": "Nhận diện các mã cổ phiếu có giao dịch bất thường (tăng nóng) được TCBS xây dựng dựa trên thuật toán máy học (phương pháp cụm) và các chỉ báo định lượng khác, nhằm phát hiện và đưa tín hiệu đầu tư sớm giúp nhà đầu tư giảm thiểu rủi ro trước khi ra quyết định đầu tư. Dữ liệu về mã cổ phiếu tăng nóng được lấy và tổng hợp từ phiên giao dịch trước đó.",
            "en": "This indicator helps in identifying stocks with unusual trading activity (overheated) based on machine learning algorithms (clustering methods) and other quantitative indicators. It aims to detect and provide early warnings to investors to minimize risks before making investment decisions. Data about overheated stocks is collected and aggregated from previous trading sessions."
          },
          "additional": {
            "vi": "",
            "en": ""
          },
          "validation": "IN_LIST",
          "type": "technical",
          "index": 0,
          "display": "droplist"
        }
      ]
    }
  ],
  "conditionsForFilter": [
    {
      "type": {
        "data": "overview",
        "lang": {
          "vi": "Tổng quan",
          "en": "Overview"
        }
      },
      "items": [
        {
          "data": "exchangeName",
          "lang": {
            "vi": "Sàn",
            "en": "Exchange"
          }
        },
        {
          "data": "industryName",
          "lang": {
            "vi": "Ngành",
            "en": "Industry"
          }
        },
        {
          "data": "roe",
          "lang": {
            "vi": "ROE",
            "en": "ROE"
          }
        },
        {
          "data": "eps",
          "lang": {
            "vi": "EPS",
            "en": "EPS"
          }
        },
        {
          "data": "pe",
          "lang": {
            "vi": "P/E",
            "en": "P/E"
          }
        },
        {
          "data": "stockRating",
          "lang": {
            "vi": "TC Rating",
            "en": "TC Rating"
          }
        },
        {
          "data": "priceGrowth1Week",
          "lang": {
            "vi": "% Thay đổi giá 1 tuần",
            "en": "Price change in week"
          }
        },
        {
          "data": "volumeVsVSma5",
          "lang": {
            "vi": "Khối lượng so với SMA(5)",
            "en": "Volume Vs SMA(5)"
          }
        },
        {
          "data": "foreignTransaction",
          "lang": {
            "vi": "GD khối ngoại",
            "en": "Net foreign transaction"
          }
        },
        {
          "data": "relativeStrength3Day",
          "lang": {
            "vi": "RS 3 ngày",
            "en": "3-days RS"
          }
        },
        {
          "data": "freeTransferRate",
          "lang": {
            "vi": "Tỷ lệ chuyển nhượng tự do",
            "en": "Free-float"
          }
        }
      ]
    },
    {
      "type": {
        "data": "fundamental",
        "lang": {
          "vi": "Cơ bản",
          "en": "Fundamental"
        }
      },
      "items": [
        {
          "data": "marketCap",
          "lang": {
            "vi": "Vốn hoá",
            "en": "Market Cap"
          }
        },
        {
          "data": "foreignVolumePercent",
          "lang": {
            "vi": "% Sở hữu NN",
            "en": "% Foreign ownership"
          }
        },
        {
          "data": "revenueGrowth1Year",
          "lang": {
            "vi": "% DT 1 năm",
            "en": "1-year revenue growth"
          }
        },
        {
          "data": "epsGrowth1Year",
          "lang": {
            "vi": "% EPS 1 năm",
            "en": "1-year EPS growth"
          }
        },
        {
          "data": "grossMargin",
          "lang": {
            "vi": "Biên LN gộp",
            "en": "Gross margin"
          }
        },
        {
          "data": "netMargin",
          "lang": {
            "vi": "Biên LN ròng",
            "en": "Net margin"
          }
        },
        {
          "data": "roe",
          "lang": {
            "vi": "ROE",
            "en": "ROE"
          }
        },
        {
          "data": "doe",
          "lang": {
            "vi": "D/E",
            "en": "D/E"
          }
        },
        {
          "data": "eps",
          "lang": {
            "vi": "EPS",
            "en": "EPS"
          }
        },
        {
          "data": "dividendYield",
          "lang": {
            "vi": "% Cổ tức",
            "en": "%Div yield"
          }
        },
        {
          "data": "pe",
          "lang": {
            "vi": "P/E",
            "en": "P/E"
          }
        },
        {
          "data": "pb",
          "lang": {
            "vi": "P/B",
            "en": "P/B"
          }
        },
        {
          "data": "evEbitda",
          "lang": {
            "vi": "EV/EBITDA",
            "en": "EV/EBITDA"
          }
        },
        {
          "data": "tcbsRecommend",
          "lang": {
            "vi": "TCBS khuyến nghị",
            "en": "TCBS's recommendations"
          }
        },
        {
          "data": "stockRating",
          "lang": {
            "vi": "TC Rating",
            "en": "TC Rating"
          }
        },
        {
          "data": "netCashPerMarketCap",
          "lang": {
            "vi": "Tiền mặt ròng/Vốn hóa",
            "en": "Net cash/Market capitalization"
          }
        },
        {
          "data": "netCashPerTotalAssets",
          "lang": {
            "vi": "Tiền mặt ròng/Tổng tài sản",
            "en": "Net cash/Total assets"
          }
        },
        {
          "data": "profitForTheLast4Quarters",
          "lang": {
            "vi": "Lợi nhuận 4 quý gần nhất",
            "en": "TTM Profit"
          }
        },
        {
          "data": "lastQuarterRevenueGrowth",
          "lang": {
            "vi": "Tăng trưởng doanh thu quý gần nhất",
            "en": "Latest quarterly revenue growth"
          }
        },
        {
          "data": "secondQuarterRevenueGrowth",
          "lang": {
            "vi": "Tăng trưởng doanh thu quý gần nhì",
            "en": "Second latest quarterly revenue growth"
          }
        },
        {
          "data": "lastQuarterProfitGrowth",
          "lang": {
            "vi": "Tăng trưởng lợi nhuận quý gần nhất",
            "en": "Latest quarterly profit growth"
          }
        },
        {
          "data": "secondQuarterProfitGrowth",
          "lang": {
            "vi": "Tăng trưởng lợi nhuận quý gần nhì",
            "en": "Second latest quarterly profit growth"
          }
        }
      ]
    },
    {
      "type": {
        "data": "technical",
        "lang": {
          "vi": "Kỹ thuật",
          "en": "Technical"
        }
      },
      "items": [
        {
          "data": "priceGrowth1Week",
          "lang": {
            "vi": "% Thay đổi giá 1 tuần",
            "en": "Price change in week"
          }
        },
        {
          "data": "priceVsSMA5",
          "lang": {
            "vi": "Giá vs SMA(5)",
            "en": "Price vs SMA(5)"
          }
        },
        {
          "data": "priceVsSma10",
          "lang": {
            "vi": "Giá vs SMA(10)",
            "en": "Price Vs SMA(10)"
          }
        },
        {
          "data": "priceVsSMA20",
          "lang": {
            "vi": "Giá vs SMA(20)",
            "en": "Price vs SMA(20)"
          }
        },
        {
          "data": "priceVsSMA100",
          "lang": {
            "vi": "Giá vs SMA(100)",
            "en": "Price vs SMA(100)"
          }
        },
        {
          "data": "priceVsSMA200",
          "lang": {
            "vi": "Giá vs SMA(200)",
            "en": "Price vs SMA(200)"
          }
        },
        {
          "data": "volumeVsVSma5",
          "lang": {
            "vi": "Khối lượng so với SMA(5)",
            "en": "Volume Vs SMA(5)"
          }
        },
        {
          "data": "volumeVsVSma10",
          "lang": {
            "vi": "Khối lượng so với SMA(10)",
            "en": "Volume Vs SMA(10)"
          }
        },
        {
          "data": "volumeVsVSma20",
          "lang": {
            "vi": "Khối lượng so với SMA(20)",
            "en": "Volume Vs SMA(20)"
          }
        },
        {
          "data": "activeBuyPercentage",
          "lang": {
            "vi": "% Mua CĐ",
            "en": "% Buy Up"
          }
        },
        {
          "data": "numIncreaseContinuousDay",
          "lang": {
            "vi": "Phiên tăng liên tiếp",
            "en": "Consecutive price increases"
          }
        },
        {
          "data": "numDecreaseContinuousDay",
          "lang": {
            "vi": "Phiên giảm liên tiếp",
            "en": "Consecutive price decreases"
          }
        },
        {
          "data": "rsi14",
          "lang": {
            "vi": "RSI (14)",
            "en": "RSI (14)"
          }
        },
        {
          "data": "priceBreakOut52Week",
          "lang": {
            "vi": "Vượt đỉnh 52 tuần",
            "en": "Breaching 52-week high"
          }
        },
        {
          "data": "priceWashOut52Week",
          "lang": {
            "vi": "Phá đáy 52 tuần",
            "en": "Breaching 52-week low"
          }
        },
        {
          "data": "macdHistogram",
          "lang": {
            "vi": "MACD Histogram",
            "en": "MACD Histogram"
          }
        },
        {
          "data": "relativeStrength3Day",
          "lang": {
            "vi": "RS 3 ngày",
            "en": "3-days RS"
          }
        },
        {
          "data": "relativeStrength1Month",
          "lang": {
            "vi": "RS 1 tháng",
            "en": "1-month RS"
          }
        },
        {
          "data": "bollingBandSignal",
          "lang": {
            "vi": "Mở Band Bollinger ",
            "en": "Expanding Bollinger Bands"
          }
        },
        {
          "data": "uptrend",
          "lang": {
            "vi": "Uptrend",
            "en": "Uptrend"
          }
        },
        {
          "data": "breakout",
          "lang": {
            "vi": "Phá nền",
            "en": "Breakout"
          }
        },
        {
          "data": "percent1YearFromPeak",
          "lang": {
            "vi": "% cách đỉnh 1 năm",
            "en": "% from 1-year high"
          }
        },
        {
          "data": "percentAwayFromHistoricalPeak",
          "lang": {
            "vi": "% cách đỉnh lịch sử ",
            "en": "% from all-time high"
          }
        },
        {
          "data": "percent1YearFromBottom",
          "lang": {
            "vi": "% cách đáy 1 năm",
            "en": "% from 1-year low"
          }
        },
        {
          "data": "percentOffHistoricalBottom",
          "lang": {
            "vi": "% cách đáy lịch sử ",
            "en": "% from all-time low"
          }
        },
        {
          "data": "vsma5",
          "lang": {
            "vi": "KL giao dịch trung bình 5 phiên",
            "en": "5-day average trading volume"
          }
        },
        {
          "data": "vsma10",
          "lang": {
            "vi": "KL giao dịch trung bình 10 phiên",
            "en": "10-day average trading volume"
          }
        },
        {
          "data": "vsma20",
          "lang": {
            "vi": "KL giao dịch trung bình 20 phiên",
            "en": "20-day average trading volume"
          }
        },
        {
          "data": "vsma50",
          "lang": {
            "vi": "KL giao dịch trung bình 50 phiên",
            "en": "50-day average trading volume"
          }
        },
        {
          "data": "percentPriceVsMa20",
          "lang": {
            "vi": "% giá hiện tại so với MA20",
            "en": "% current price relative to MA20"
          }
        },
        {
          "data": "percentPriceVsMa50",
          "lang": {
            "vi": "% giá hiện tại so với MA50",
            "en": "% current price relative to MA50"
          }
        },
        {
          "data": "percentPriceVsMa100",
          "lang": {
            "vi": "% giá hiện tại so với MA100",
            "en": "% current price relative to MA100"
          }
        },
        {
          "data": "percentPriceVsMa200",
          "lang": {
            "vi": "% giá hiện tại so với MA200",
            "en": "% current price relative to MA200"
          }
        }
      ]
    }
  ],
  "conditionsForOptions": [
    {
      "type": {
        "data": "overview",
        "lang": {
          "vi": "Tổng quan",
          "en": "Overview"
        }
      },
      "items": [
        {
          "data": "exchangeName",
          "lang": {
            "vi": "Sàn",
            "en": "Exchange"
          }
        },
        {
          "data": "industryName",
          "lang": {
            "vi": "Ngành",
            "en": "Industry"
          }
        },
        {
          "data": "eps",
          "lang": {
            "vi": "EPS",
            "en": "EPS"
          }
        },
        {
          "data": "roe",
          "lang": {
            "vi": "ROE",
            "en": "ROE"
          }
        },
        {
          "data": "pe",
          "lang": {
            "vi": "P/E",
            "en": "P/E"
          }
        },
        {
          "data": "stockRating",
          "lang": {
            "vi": "TC Rating",
            "en": "TC Rating"
          }
        },
        {
          "data": "relativeStrength3Day",
          "lang": {
            "vi": "RS 3 ngày",
            "en": "3-days RS"
          }
        },
        {
          "data": "priceGrowth1Week",
          "lang": {
            "vi": "% Thay đổi giá 1 tuần",
            "en": "Price change in week"
          }
        },
        {
          "data": "foreignTransaction",
          "lang": {
            "vi": "GD khối ngoại",
            "en": "Net foreign transaction"
          }
        },
        {
          "data": "freeTransferRate",
          "lang": {
            "vi": "Tỷ lệ chuyển nhượng tự do",
            "en": "Free-float"
          }
        }
      ]
    },
    {
      "type": {
        "data": "fundamental",
        "lang": {
          "vi": "Cơ bản",
          "en": "Fundamental"
        }
      },
      "items": [
        {
          "data": "marketCap",
          "lang": {
            "vi": "Vốn hoá",
            "en": "Market Cap"
          }
        },
        {
          "data": "revenueGrowth1Year",
          "lang": {
            "vi": "% DT 1 năm",
            "en": "1-year revenue growth"
          }
        },
        {
          "data": "revenueGrowth5Year",
          "lang": {
            "vi": "% DT 5 năm",
            "en": "5-years revenue growth"
          }
        },
        {
          "data": "epsGrowth1Year",
          "lang": {
            "vi": "% EPS 1 năm",
            "en": "1-year EPS growth"
          }
        },
        {
          "data": "epsGrowth5Year",
          "lang": {
            "vi": "% EPS 5 năm",
            "en": "5-years EPS growth"
          }
        },
        {
          "data": "grossMargin",
          "lang": {
            "vi": "Biên LN gộp",
            "en": "Gross margin"
          }
        },
        {
          "data": "netMargin",
          "lang": {
            "vi": "Biên LN ròng",
            "en": "Net margin"
          }
        },
        {
          "data": "doe",
          "lang": {
            "vi": "D/E",
            "en": "D/E"
          }
        },
        {
          "data": "pb",
          "lang": {
            "vi": "P/B",
            "en": "P/B"
          }
        },
        {
          "data": "evEbitda",
          "lang": {
            "vi": "EV/EBITDA",
            "en": "EV/EBITDA"
          }
        },
        {
          "data": "dividendYield",
          "lang": {
            "vi": "% Cổ tức",
            "en": "%Div yield"
          }
        },
        {
          "data": "tcbsRecommend",
          "lang": {
            "vi": "TCBS khuyến nghị",
            "en": "TCBS's recommendations"
          }
        },
        {
          "data": "businessModel",
          "lang": {
            "vi": "Mô hình KD",
            "en": "Business model"
          }
        },
        {
          "data": "businessOperation",
          "lang": {
            "vi": "Hiệu quả HĐ",
            "en": "Operational efficiency"
          }
        },
        {
          "data": "financialHealth",
          "lang": {
            "vi": "Sức khoẻ TC",
            "en": "Financial health"
          }
        },
        {
          "data": "netCashPerMarketCap",
          "lang": {
            "vi": "Tiền mặt ròng/Vốn hóa",
            "en": "Net cash/Market capitalization"
          }
        },
        {
          "data": "netCashPerTotalAssets",
          "lang": {
            "vi": "Tiền mặt ròng/Tổng tài sản",
            "en": "Net cash/Total assets"
          }
        },
        {
          "data": "profitForTheLast4Quarters",
          "lang": {
            "vi": "Lợi nhuận 4 quý gần nhất",
            "en": "TTM Profit"
          }
        },
        {
          "data": "lastQuarterRevenueGrowth",
          "lang": {
            "vi": "Tăng trưởng doanh thu quý gần nhất",
            "en": "Latest quarterly revenue growth"
          }
        },
        {
          "data": "secondQuarterRevenueGrowth",
          "lang": {
            "vi": "Tăng trưởng doanh thu quý gần nhì",
            "en": "Second latest quarterly revenue growth"
          }
        },
        {
          "data": "lastQuarterProfitGrowth",
          "lang": {
            "vi": "Tăng trưởng lợi nhuận quý gần nhất",
            "en": "Latest quarterly profit growth"
          }
        },
        {
          "data": "secondQuarterProfitGrowth",
          "lang": {
            "vi": "Tăng trưởng lợi nhuận quý gần nhì",
            "en": "Second latest quarterly profit growth"
          }
        },
        {
          "data": "corporatePercentage",
          "lang": {
            "vi": "Tỷ lệ sở hữu tổ chức",
            "en": "Institutional ownership ratio"
          }
        },
        {
          "data": "ev",
          "lang": {
            "vi": "Giá trị doanh nghiệp (EV)",
            "en": "Enterprise value (EV)"
          }
        },
        {
          "data": "quarterRevenueGrowth",
          "lang": {
            "vi": "Tăng trưởng doanh thu thuần QoQ",
            "en": "Net revenue growth QoQ"
          }
        },
        {
          "data": "quarterIncomeGrowth",
          "lang": {
            "vi": "Tăng trưởng lợi nhuận ròng QoQ",
            "en": "Net profit growth QoQ"
          }
        },
        {
          "data": "pegForward",
          "lang": {
            "vi": "PEG Foward",
            "en": "PEG Forward"
          }
        },
        {
          "data": "pegTrailing",
          "lang": {
            "vi": "PEG Trailing",
            "en": "PEG Trailing"
          }
        },
        {
          "data": "quarterlyIncome",
          "lang": {
            "vi": "Lợi nhuận ròng quý gần nhất",
            "en": "Most recent quarterly net profit"
          }
        },
        {
          "data": "quarterlyRevenue",
          "lang": {
            "vi": "Doanh thu thuần quý gần nhất",
            "en": "Most recent quarterly net revenue"
          }
        },
        {
          "data": "ps",
          "lang": {
            "vi": "Tỷ lệ P/S",
            "en": "P/S ratio"
          }
        },
        {
          "data": "roa",
          "lang": {
            "vi": "ROA",
            "en": "ROA"
          }
        },
        {
          "data": "npl",
          "lang": {
            "vi": "Tỷ lệ nợ xấu",
            "en": "Bad debt ratio"
          }
        },
        {
          "data": "nim",
          "lang": {
            "vi": "Biên lãi thuần (NIM)",
            "en": "Net interest margin (NIM)"
          }
        },
        {
          "data": "epsTTMGrowth1Year",
          "lang": {
            "vi": "% tăng trưởng EPS TTM trong 1 năm",
            "en": "% growth in EPS TTM over 1 year"
          }
        },
        {
          "data": "epsTTMGrowth5Year",
          "lang": {
            "vi": "% tăng trưởng EPS TTM trong 5 năm",
            "en": "% growth in EPS TTM over 5 year"
          }
        },
        {
          "data": "equityMI",
          "lang": {
            "vi": "Vốn chủ sở hữu sau lợi ích của cổ đông thiểu số",
            "en": "Equity after Minority Interest"
          }
        },
        {
          "data": "epsRecently",
          "lang": {
            "vi": "EPS quý gần nhất",
            "en": "EPS of the most recent quarter"
          }
        }
      ]
    },
    {
      "type": {
        "data": "technical",
        "lang": {
          "vi": "Kỹ thuật",
          "en": "Technical"
        }
      },
      "items": [
        {
          "data": "priceVsSMA5",
          "lang": {
            "vi": "Giá vs SMA(5)",
            "en": "Price vs SMA(5)"
          }
        },
        {
          "data": "priceVsSma10",
          "lang": {
            "vi": "Giá vs SMA(10)",
            "en": "Price Vs SMA(10)"
          }
        },
        {
          "data": "priceVsSMA20",
          "lang": {
            "vi": "Giá vs SMA(20)",
            "en": "Price vs SMA(20)"
          }
        },
        {
          "data": "priceVsSma50",
          "lang": {
            "vi": "Giá vs SMA(50)",
            "en": "Price Vs SMA(50)"
          }
        },
        {
          "data": "priceVsSMA100",
          "lang": {
            "vi": "Giá vs SMA(100)",
            "en": "Price vs SMA(100)"
          }
        },
        {
          "data": "priceVsSMA200",
          "lang": {
            "vi": "Giá vs SMA(200)",
            "en": "Price vs SMA(200)"
          }
        },
        {
          "data": "numIncreaseContinuousDay",
          "lang": {
            "vi": "Phiên tăng liên tiếp",
            "en": "Consecutive price increases"
          }
        },
        {
          "data": "numDecreaseContinuousDay",
          "lang": {
            "vi": "Phiên giảm liên tiếp",
            "en": "Consecutive price decreases"
          }
        },
        {
          "data": "priceBreakOut52Week",
          "lang": {
            "vi": "Vượt đỉnh 52 tuần",
            "en": "Breaching 52-week high"
          }
        },
        {
          "data": "priceWashOut52Week",
          "lang": {
            "vi": "Phá đáy 52 tuần",
            "en": "Breaching 52-week low"
          }
        },
        {
          "data": "volumeVsVSma5",
          "lang": {
            "vi": "Khối lượng so với SMA(5)",
            "en": "Volume Vs SMA(5)"
          }
        },
        {
          "data": "volumeVsVSma10",
          "lang": {
            "vi": "Khối lượng so với SMA(10)",
            "en": "Volume Vs SMA(10)"
          }
        },
        {
          "data": "volumeVsVSma20",
          "lang": {
            "vi": "Khối lượng so với SMA(20)",
            "en": "Volume Vs SMA(20)"
          }
        },
        {
          "data": "volumeVsVSma50",
          "lang": {
            "vi": "Khối lượng so với SMA(50)",
            "en": "Volume Vs SMA(50)"
          }
        },
        {
          "data": "suddenlyHighVolumeMatching",
          "lang": {
            "vi": "Tốc độ khớp lệnh",
            "en": "Trading speed"
          }
        },
        {
          "data": "totalTradingValue",
          "lang": {
            "vi": "GT khớp lệnh",
            "en": "Matched value"
          }
        },
        {
          "data": "avgTradingValue5Day",
          "lang": {
            "vi": "GTGD 1 tuần",
            "en": "1-week liquidity"
          }
        },
        {
          "data": "avgTradingValue10Day",
          "lang": {
            "vi": "GTGD 10 ngày",
            "en": "10-days liquidity"
          }
        },
        {
          "data": "avgTradingValue20Day",
          "lang": {
            "vi": "GTGD 1 tháng",
            "en": "1-month liquidity"
          }
        },
        {
          "data": "alpha",
          "lang": {
            "vi": "Alpha",
            "en": "Alpha"
          }
        },
        {
          "data": "beta",
          "lang": {
            "vi": "Beta",
            "en": "Beta"
          }
        },
        {
          "data": "strongBuyPercentage",
          "lang": {
            "vi": "% Dư mua",
            "en": "% Bid"
          }
        },
        {
          "data": "activeBuyPercentage",
          "lang": {
            "vi": "% Mua CĐ",
            "en": "% Buy Up"
          }
        },
        {
          "data": "foreignVolumePercent",
          "lang": {
            "vi": "% Sở hữu NN",
            "en": "% Foreign ownership"
          }
        },
        {
          "data": "foreignBuySell20Session",
          "lang": {
            "vi": "GD khối ngoại 20 phiên",
            "en": "20-days foreign trade"
          }
        },
        {
          "data": "tcbsBuySellSignal",
          "lang": {
            "vi": "Tín hiệu kỹ thuật",
            "en": "TCBS's technical signals"
          }
        },
        {
          "data": "rsi14",
          "lang": {
            "vi": "RSI (14)",
            "en": "RSI (14)"
          }
        },
        {
          "data": "rsi14Status",
          "lang": {
            "vi": "Trạng thái RSI(14)",
            "en": "RSI(14) Status"
          }
        },
        {
          "data": "relativeStrength3Day",
          "lang": {
            "vi": "RS 3 ngày",
            "en": "3-days RS"
          }
        },
        {
          "data": "relativeStrength1Month",
          "lang": {
            "vi": "RS 1 tháng",
            "en": "1-month RS"
          }
        },
        {
          "data": "relativeStrength3Month",
          "lang": {
            "vi": "RS 3 tháng",
            "en": "3-months RS"
          }
        },
        {
          "data": "relativeStrength1Year",
          "lang": {
            "vi": "RS 1 năm",
            "en": "1-years RS"
          }
        },
        {
          "data": "tcRS",
          "lang": {
            "vi": "RS trung bình",
            "en": "Average RS"
          }
        },
        {
          "data": "bollingBandSignal",
          "lang": {
            "vi": "Mở Band Bollinger ",
            "en": "Expanding Bollinger Bands"
          }
        },
        {
          "data": "macdHistogram",
          "lang": {
            "vi": "MACD Histogram",
            "en": "MACD Histogram"
          }
        },
        {
          "data": "sarVsMacdHist",
          "lang": {
            "vi": "SAR x MACD Histogram",
            "en": "SAR x MACD Histogram"
          }
        },
        {
          "data": "dmiSignal",
          "lang": {
            "vi": "Lướt sóng vs DMI",
            "en": "Trading with DMI"
          }
        },
        {
          "data": "uptrend",
          "lang": {
            "vi": "Uptrend",
            "en": "Uptrend"
          }
        },
        {
          "data": "breakout",
          "lang": {
            "vi": "Phá nền",
            "en": "Breakout"
          }
        },
        {
          "data": "percent1YearFromPeak",
          "lang": {
            "vi": "% cách đỉnh 1 năm",
            "en": "% from 1-year high"
          }
        },
        {
          "data": "percentAwayFromHistoricalPeak",
          "lang": {
            "vi": "% cách đỉnh lịch sử ",
            "en": "% from all-time high"
          }
        },
        {
          "data": "percent1YearFromBottom",
          "lang": {
            "vi": "% cách đáy 1 năm",
            "en": "% from 1-year low"
          }
        },
        {
          "data": "percentOffHistoricalBottom",
          "lang": {
            "vi": "% cách đáy lịch sử ",
            "en": "% from all-time low"
          }
        },
        {
          "data": "heatingUp",
          "lang": {
            "vi": "Tăng nóng",
            "en": "Overheated"
          }
        },
        {
          "data": "vsma5",
          "lang": {
            "vi": "KL giao dịch trung bình 5 phiên",
            "en": "5-day average trading volume"
          }
        },
        {
          "data": "vsma10",
          "lang": {
            "vi": "KL giao dịch trung bình 10 phiên",
            "en": "10-day average trading volume"
          }
        },
        {
          "data": "vsma20",
          "lang": {
            "vi": "KL giao dịch trung bình 20 phiên",
            "en": "20-day average trading volume"
          }
        },
        {
          "data": "vsma50",
          "lang": {
            "vi": "KL giao dịch trung bình 50 phiên",
            "en": "50-day average trading volume"
          }
        },
        {
          "data": "percentPriceVsMa20",
          "lang": {
            "vi": "% giá hiện tại so với MA20",
            "en": "% current price relative to MA20"
          }
        },
        {
          "data": "percentPriceVsMa50",
          "lang": {
            "vi": "% giá hiện tại so với MA50",
            "en": "% current price relative to MA50"
          }
        },
        {
          "data": "percentPriceVsMa100",
          "lang": {
            "vi": "% giá hiện tại so với MA100",
            "en": "% current price relative to MA100"
          }
        },
        {
          "data": "percentPriceVsMa200",
          "lang": {
            "vi": "% giá hiện tại so với MA200",
            "en": "% current price relative to MA200"
          }
        }
      ]
    }
  ],
  "keyDetails": [
    {
      "data": "industryName",
      "lang": {
        "vi": "Ngành",
        "en": "Industry"
      }
    },
    {
      "data": "marketCap",
      "lang": {
        "vi": "Vốn hoá",
        "en": "Market Cap"
      }
    },
    {
      "data": "roe",
      "lang": {
        "vi": "ROE",
        "en": "ROE"
      }
    },
    {
      "data": "stockRating",
      "lang": {
        "vi": "TC Rating",
        "en": "TC Rating"
      }
    },
    {
      "data": "businessModel",
      "lang": {
        "vi": "Mô hình KD",
        "en": "Business model"
      }
    },
    {
      "data": "businessOperation",
      "lang": {
        "vi": "Hiệu quả HĐ",
        "en": "Operational efficiency"
      }
    },
    {
      "data": "financialHealth",
      "lang": {
        "vi": "Sức khoẻ TC",
        "en": "Financial health"
      }
    },
    {
      "data": "beta",
      "lang": {
        "vi": "Beta",
        "en": "Beta"
      }
    },
    {
      "data": "alpha",
      "lang": {
        "vi": "Alpha",
        "en": "Alpha"
      }
    },
    {
      "data": "uptrend",
      "lang": {
        "vi": "Uptrend",
        "en": "Uptrend"
      }
    },
    {
      "data": "bullishBreakout",
      "lang": {
        "vi": "Phá nền mua",
        "en": "Bullish breakout"
      }
    },
    {
      "data": "bearishBreakout",
      "lang": {
        "vi": "Phá nền bán",
        "en": "Bearish breakout"
      }
    },
    {
      "data": "pe",
      "lang": {
        "vi": "P/E",
        "en": "P/E"
      }
    },
    {
      "data": "pb",
      "lang": {
        "vi": "P/B",
        "en": "P/B"
      }
    },
    {
      "data": "evEbitda",
      "lang": {
        "vi": "EV/EBITDA",
        "en": "EV/EBITDA"
      }
    },
    {
      "data": "dividendYield",
      "lang": {
        "vi": "% Cổ tức",
        "en": "%Div yield"
      }
    },
    {
      "data": "activeBuyPercentage",
      "lang": {
        "vi": "% Mua CĐ",
        "en": "% Buy Up"
      }
    },
    {
      "data": "suddenlyHighVolumeMatching",
      "lang": {
        "vi": "Tốc độ khớp lệnh",
        "en": "Trading speed"
      }
    },
    {
      "data": "strongBuyPercentage",
      "lang": {
        "vi": "% Dư mua",
        "en": "% Bid"
      }
    },
    {
      "data": "forecastVolumeRatio",
      "lang": {
        "vi": "KL dự kiến so với SMA(5)",
        "en": "Expected volume vs SMA(5)"
      }
    },
    {
      "data": "priceVsSMA5",
      "lang": {
        "vi": "Giá vs SMA(5)",
        "en": "Price vs SMA(5)"
      }
    },
    {
      "data": "priceVsSMA20",
      "lang": {
        "vi": "Giá vs SMA(20)",
        "en": "Price vs SMA(20)"
      }
    },
    {
      "data": "revenueGrowth1Year",
      "lang": {
        "vi": "% DT 1 năm",
        "en": "1-year revenue growth"
      }
    },
    {
      "data": "revenueGrowth5Year",
      "lang": {
        "vi": "% DT 5 năm",
        "en": "5-years revenue growth"
      }
    },
    {
      "data": "epsGrowth1Year",
      "lang": {
        "vi": "% EPS 1 năm",
        "en": "1-year EPS growth"
      }
    },
    {
      "data": "epsGrowth5Year",
      "lang": {
        "vi": "% EPS 5 năm",
        "en": "5-years EPS growth"
      }
    },
    {
      "data": "grossMargin",
      "lang": {
        "vi": "Biên LN gộp",
        "en": "Gross margin"
      }
    },
    {
      "data": "netMargin",
      "lang": {
        "vi": "Biên LN ròng",
        "en": "Net margin"
      }
    },
    {
      "data": "doe",
      "lang": {
        "vi": "D/E",
        "en": "D/E"
      }
    },
    {
      "data": "priceIncrease1Week",
      "lang": {
        "vi": "% Giá tăng 1 tuần",
        "en": "1-week price increase"
      }
    },
    {
      "data": "priceDecrease1Week",
      "lang": {
        "vi": "% Giá giảm 1 tuần",
        "en": "1-week price decrease"
      }
    },
    {
      "data": "priceIncrease1Month",
      "lang": {
        "vi": "% Giá tăng 1 tháng",
        "en": "1-month price increase"
      }
    },
    {
      "data": "priceDecrease1Month",
      "lang": {
        "vi": "% Giá giảm 1 tháng",
        "en": "1-month price decrease"
      }
    },
    {
      "data": "avgTradingValue5Day",
      "lang": {
        "vi": "GTGD 1 tuần",
        "en": "1-week liquidity"
      }
    },
    {
      "data": "avgTradingValue10Day",
      "lang": {
        "vi": "GTGD 10 ngày",
        "en": "10-days liquidity"
      }
    },
    {
      "data": "avgTradingValue20Day",
      "lang": {
        "vi": "GTGD 1 tháng",
        "en": "1-month liquidity"
      }
    },
    {
      "data": "foreignTransaction",
      "lang": {
        "vi": "GD khối ngoại",
        "en": "Net foreign transaction"
      }
    },
    {
      "data": "totalTradingValue",
      "lang": {
        "vi": "GT khớp lệnh",
        "en": "Matched value"
      }
    },
    {
      "data": "priceNearRealtime",
      "lang": {
        "vi": "Thị giá",
        "en": "Price"
      }
    },
    {
      "data": "foreignVolumePercent",
      "lang": {
        "vi": "% Sở hữu NN",
        "en": "% Foreign ownership"
      }
    },
    {
      "data": "rsi14",
      "lang": {
        "vi": "RSI (14)",
        "en": "RSI (14)"
      }
    },
    {
      "data": "relativeStrength3Day",
      "lang": {
        "vi": "RS 3 ngày",
        "en": "3-days RS"
      }
    },
    {
      "data": "relativeStrength1Month",
      "lang": {
        "vi": "RS 1 tháng",
        "en": "1-month RS"
      }
    },
    {
      "data": "relativeStrength3Month",
      "lang": {
        "vi": "RS 3 tháng",
        "en": "3-months RS"
      }
    },
    {
      "data": "relativeStrength1Year",
      "lang": {
        "vi": "RS 1 năm",
        "en": "1-years RS"
      }
    },
    {
      "data": "tcRS",
      "lang": {
        "vi": "RS trung bình",
        "en": "Average RS"
      }
    },
    {
      "data": "tcbsRecommend",
      "lang": {
        "vi": "TCBS khuyến nghị",
        "en": "TCBS's recommendations"
      }
    },
    {
      "data": "tcbsBuySellSignal",
      "lang": {
        "vi": "Tín hiệu kỹ thuật",
        "en": "TCBS's technical signals"
      }
    },
    {
      "data": "foreignBuySell20Session",
      "lang": {
        "vi": "GD khối ngoại 20 phiên",
        "en": "20-days foreign trade"
      }
    },
    {
      "data": "numIncreaseContinuousDay",
      "lang": {
        "vi": "Phiên tăng liên tiếp",
        "en": "Consecutive price increases"
      }
    },
    {
      "data": "numDecreaseContinuousDay",
      "lang": {
        "vi": "Phiên giảm liên tiếp",
        "en": "Consecutive price decreases"
      }
    },
    {
      "data": "eps",
      "lang": {
        "vi": "EPS",
        "en": "EPS"
      }
    },
    {
      "data": "macdHistogram",
      "lang": {
        "vi": "MACD Histogram",
        "en": "MACD Histogram"
      }
    },
    {
      "data": "volumeVsVSma5",
      "lang": {
        "vi": "Khối lượng so với SMA(5)",
        "en": "Volume Vs SMA(5)"
      }
    },
    {
      "data": "volumeVsVSma10",
      "lang": {
        "vi": "Khối lượng so với SMA(10)",
        "en": "Volume Vs SMA(10)"
      }
    },
    {
      "data": "volumeVsVSma20",
      "lang": {
        "vi": "Khối lượng so với SMA(20)",
        "en": "Volume Vs SMA(20)"
      }
    },
    {
      "data": "volumeVsVSma50",
      "lang": {
        "vi": "Khối lượng so với SMA(50)",
        "en": "Volume Vs SMA(50)"
      }
    },
    {
      "data": "priceVsSma10",
      "lang": {
        "vi": "Giá vs SMA(10)",
        "en": "Price Vs SMA(10)"
      }
    },
    {
      "data": "priceVsSma50",
      "lang": {
        "vi": "Giá vs SMA(50)",
        "en": "Price Vs SMA(50)"
      }
    },
    {
      "data": "priceBreakOut52Week",
      "lang": {
        "vi": "Vượt đỉnh 52 tuần",
        "en": "Breaching 52-week high"
      }
    },
    {
      "data": "priceWashOut52Week",
      "lang": {
        "vi": "Phá đáy 52 tuần",
        "en": "Breaching 52-week low"
      }
    },
    {
      "data": "sarVsMacdHist",
      "lang": {
        "vi": "SAR x MACD Histogram",
        "en": "SAR x MACD Histogram"
      }
    },
    {
      "data": "bollingBandSignal",
      "lang": {
        "vi": "Mở Band Bollinger ",
        "en": "Expanding Bollinger Bands"
      }
    },
    {
      "data": "dmiSignal",
      "lang": {
        "vi": "Lướt sóng vs DMI",
        "en": "Trading with DMI"
      }
    },
    {
      "data": "rsi14Status",
      "lang": {
        "vi": "Trạng thái RSI(14)",
        "en": "RSI(14) Status"
      }
    },
    {
      "data": "exchangeName",
      "lang": {
        "vi": "Sàn",
        "en": "Exchange"
      }
    },
    {
      "data": "price",
      "lang": {
        "vi": "Thị giá",
        "en": "Price"
      }
    },
    {
      "data": "priceIncreaseInDay",
      "lang": {
        "vi": "% Giá tăng trong ngày",
        "en": "Price increase in day"
      }
    },
    {
      "data": "priceDecreaseInDay",
      "lang": {
        "vi": "% Giá giảm trong ngày",
        "en": "Price decrease in day"
      }
    },
    {
      "data": "breakout",
      "lang": {
        "vi": "Phá nền",
        "en": "Breakout"
      }
    },
    {
      "data": "vnIndex",
      "lang": {
        "vi": "% Thay đổi VNINDEX",
        "en": "% Change in VNINDEX"
      }
    },
    {
      "data": "priceVsRefPercent",
      "lang": {
        "vi": "% Thay đổi giá 1 ngày",
        "en": "Price change in day"
      }
    },
    {
      "data": "priceGrowth1Week",
      "lang": {
        "vi": "% Thay đổi giá 1 tuần",
        "en": "Price change in week"
      }
    },
    {
      "data": "priceGrowth1Month",
      "lang": {
        "vi": "% Thay đổi giá 1 tháng",
        "en": "Price change in month"
      }
    },
    {
      "data": "prev1DayGrowthPercent",
      "lang": {
        "vi": "1D",
        "en": "1D"
      }
    },
    {
      "data": "prev1MonthGrowthPercent",
      "lang": {
        "vi": "1M",
        "en": "1M"
      }
    },
    {
      "data": "prev1YearGrowthPercent",
      "lang": {
        "vi": "1Y",
        "en": "1Y"
      }
    },
    {
      "data": "prev5YearGrowthPercent",
      "lang": {
        "vi": "5Y",
        "en": "5Y"
      }
    },
    {
      "data": "hasFinancialReport",
      "lang": {
        "vi": "Có BCTC quý gần nhất",
        "en": "Has Financial Report"
      }
    },
    {
      "data": "freeTransferRate",
      "lang": {
        "vi": "Tỷ lệ chuyển nhượng tự do",
        "en": "Free-float"
      }
    },
    {
      "data": "netCashPerMarketCap",
      "lang": {
        "vi": "Tiền mặt ròng/Vốn hóa",
        "en": "Net cash/Market capitalization"
      }
    },
    {
      "data": "netCashPerTotalAssets",
      "lang": {
        "vi": "Tiền mặt ròng/Tổng tài sản",
        "en": "Net cash/Total assets"
      }
    },
    {
      "data": "profitForTheLast4Quarters",
      "lang": {
        "vi": "Lợi nhuận 4 quý gần nhất",
        "en": "TTM Profit"
      }
    },
    {
      "data": "lastQuarterRevenueGrowth",
      "lang": {
        "vi": "Tăng trưởng doanh thu quý gần nhất",
        "en": "Latest quarterly revenue growth"
      }
    },
    {
      "data": "secondQuarterRevenueGrowth",
      "lang": {
        "vi": "Tăng trưởng doanh thu quý gần nhì",
        "en": "Second latest quarterly revenue growth"
      }
    },
    {
      "data": "lastQuarterProfitGrowth",
      "lang": {
        "vi": "Tăng trưởng lợi nhuận quý gần nhất",
        "en": "Latest quarterly profit growth"
      }
    },
    {
      "data": "secondQuarterProfitGrowth",
      "lang": {
        "vi": "Tăng trưởng lợi nhuận quý gần nhì",
        "en": "Second latest quarterly profit growth"
      }
    },
    {
      "data": "percent1YearFromPeak",
      "lang": {
        "vi": "% cách đỉnh 1 năm",
        "en": "% from 1-year high"
      }
    },
    {
      "data": "percentAwayFromHistoricalPeak",
      "lang": {
        "vi": "% cách đỉnh lịch sử ",
        "en": "% from all-time high"
      }
    },
    {
      "data": "percent1YearFromBottom",
      "lang": {
        "vi": "% cách đáy 1 năm",
        "en": "% from 1-year low"
      }
    },
    {
      "data": "percentOffHistoricalBottom",
      "lang": {
        "vi": "% cách đáy lịch sử ",
        "en": "% from all-time low"
      }
    },
    {
      "data": "priceVsSMA100",
      "lang": {
        "vi": "Giá vs SMA(100)",
        "en": "Price vs SMA(100)"
      }
    },
    {
      "data": "heatingUp",
      "lang": {
        "vi": "Tăng nóng",
        "en": "Overheated"
      }
    },
    {
      "data": "priceIndex",
      "lang": {
        "vi": "Thị giá",
        "en": "Price"
      }
    },
    {
      "data": "priceGrowth1Day",
      "lang": {
        "vi": "% Thay đổi giá hôm nay",
        "en": "Price change in day"
      }
    },
    {
      "data": "vsma5",
      "lang": {
        "vi": "KL giao dịch trung bình 5 phiên",
        "en": "5-day average trading volume"
      }
    },
    {
      "data": "vsma10",
      "lang": {
        "vi": "KL giao dịch trung bình 10 phiên",
        "en": "10-day average trading volume"
      }
    },
    {
      "data": "vsma20",
      "lang": {
        "vi": "KL giao dịch trung bình 20 phiên",
        "en": "20-day average trading volume"
      }
    },
    {
      "data": "vsma50",
      "lang": {
        "vi": "KL giao dịch trung bình 50 phiên",
        "en": "50-day average trading volume"
      }
    },
    {
      "data": "corporatePercentage",
      "lang": {
        "vi": "Tỷ lệ sở hữu tổ chức",
        "en": "Institutional ownership ratio"
      }
    },
    {
      "data": "ev",
      "lang": {
        "vi": "Giá trị doanh nghiệp (EV)",
        "en": "Enterprise value (EV)"
      }
    },
    {
      "data": "quarterRevenueGrowth",
      "lang": {
        "vi": "Tăng trưởng doanh thu thuần QoQ",
        "en": "Net revenue growth QoQ"
      }
    },
    {
      "data": "quarterIncomeGrowth",
      "lang": {
        "vi": "Tăng trưởng lợi nhuận ròng QoQ",
        "en": "Net profit growth QoQ"
      }
    },
    {
      "data": "pegForward",
      "lang": {
        "vi": "PEG Foward",
        "en": "PEG Forward"
      }
    },
    {
      "data": "pegTrailing",
      "lang": {
        "vi": "PEG Trailing",
        "en": "PEG Trailing"
      }
    },
    {
      "data": "quarterlyIncome",
      "lang": {
        "vi": "Lợi nhuận ròng quý gần nhất",
        "en": "Most recent quarterly net profit"
      }
    },
    {
      "data": "quarterlyRevenue",
      "lang": {
        "vi": "Doanh thu thuần quý gần nhất",
        "en": "Most recent quarterly net revenue"
      }
    },
    {
      "data": "ps",
      "lang": {
        "vi": "Tỷ lệ P/S",
        "en": "P/S ratio"
      }
    },
    {
      "data": "roa",
      "lang": {
        "vi": "ROA",
        "en": "ROA"
      }
    },
    {
      "data": "npl",
      "lang": {
        "vi": "Tỷ lệ nợ xấu",
        "en": "Bad debt ratio"
      }
    },
    {
      "data": "nim",
      "lang": {
        "vi": "Biên lãi thuần (NIM)",
        "en": "Net interest margin (NIM)"
      }
    },
    {
      "data": "priceVsSMA200",
      "lang": {
        "vi": "Giá vs SMA(200)",
        "en": "Price vs SMA(200)"
      }
    },
    {
      "data": "epsTTMGrowth1Year",
      "lang": {
        "vi": "% tăng trưởng EPS TTM trong 1 năm",
        "en": "% growth in EPS TTM over 1 year"
      }
    },
    {
      "data": "epsTTMGrowth5Year",
      "lang": {
        "vi": "% tăng trưởng EPS TTM trong 5 năm",
        "en": "% growth in EPS TTM over 5 year"
      }
    },
    {
      "data": "equityMI",
      "lang": {
        "vi": "Vốn chủ sở hữu sau lợi ích của cổ đông thiểu số",
        "en": "Equity after Minority Interest"
      }
    },
    {
      "data": "epsRecently",
      "lang": {
        "vi": "EPS quý gần nhất",
        "en": "EPS of the most recent quarter"
      }
    },
    {
      "data": "percentPriceVsMa200",
      "lang": {
        "vi": "% giá hiện tại so với MA200",
        "en": "% current price relative to MA200"
      }
    },
    {
      "data": "percentPriceVsMa20",
      "lang": {
        "vi": "% giá hiện tại so với MA20",
        "en": "% current price relative to MA20"
      }
    },
    {
      "data": "percentPriceVsMa50",
      "lang": {
        "vi": "% giá hiện tại so với MA50",
        "en": "% current price relative to MA50"
      }
    },
    {
      "data": "percentPriceVsMa100",
      "lang": {
        "vi": "% giá hiện tại so với MA100",
        "en": "% current price relative to MA100"
      }
    }
  ],
  "tcbsFilters": [
    {
      "id": 10,
      "templateName": {
        "vi": "Bộ lọc CANSLIM",
        "en": "CANSLIM"
      },
      "filters": [
        {
          "key": "lastQuarterProfitGrowth",
          "operator": ">=",
          "value": 25,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "epsGrowth1Year",
          "operator": ">=",
          "value": 25,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "roe",
          "operator": ">=",
          "value": 15,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 10,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "relativeStrength1Month",
          "operator": ">=",
          "value": 85,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 3,
      "templateName": {
        "vi": "Giá trị",
        "en": "Valuation"
      },
      "filters": [
        {
          "key": "roe",
          "operator": ">=",
          "value": 10,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "pe",
          "operator": "<=",
          "value": 9,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 4,
      "templateName": {
        "vi": "Cổ tức cao",
        "en": "High dividends"
      },
      "filters": [
        {
          "key": "dividendYield",
          "operator": ">=",
          "value": 6,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 5,
      "templateName": {
        "vi": "Phá nền mua",
        "en": "Bullish breakout"
      },
      "filters": [
        {
          "key": "breakout",
          "operator": "=",
          "value": "BULLISH",
          "unit": null,
          "display": "droplist"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "forecastVolumeRatio",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 6,
      "templateName": {
        "vi": "Giá tăng + Đột biến khối lượng",
        "en": "Price Increase + Abnormal volume"
      },
      "filters": [
        {
          "key": "priceIncreaseInDay",
          "operator": ">=",
          "value": 3,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "forecastVolumeRatio",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 7,
      "templateName": {
        "vi": "Vượt đỉnh 52 tuần",
        "en": "52-week high"
      },
      "filters": [
        {
          "key": "priceBreakOut52Week",
          "operator": "=",
          "value": "BREAK_OUT",
          "unit": null,
          "display": "fix"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 8,
      "templateName": {
        "vi": "Phá đáy 52 tuần",
        "en": "52-week low"
      },
      "filters": [
        {
          "key": "priceWashOut52Week",
          "operator": "=",
          "value": "WASH_OUT",
          "unit": null,
          "display": "fix"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 9,
      "templateName": {
        "vi": "Uptrend ngắn hạn",
        "en": "Short-term Uptrend"
      },
      "filters": [
        {
          "key": "uptrend",
          "operator": "=",
          "value": "buy-signal",
          "unit": null,
          "display": "fix"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 2,
      "templateName": {
        "vi": "Vượt trội ngắn hạn",
        "en": "Short-term Outstanding"
      },
      "filters": [
        {
          "key": "relativeStrength3Day",
          "operator": ">=",
          "value": 80,
          "unit": null,
          "display": "chart"
        }
      ]
    },
    {
      "id": 1,
      "templateName": {
        "vi": "Tăng trưởng",
        "en": "Growth"
      },
      "filters": [
        {
          "key": "roe",
          "operator": ">=",
          "value": 15,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "epsGrowth1Year",
          "operator": ">=",
          "value": 15,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 2,
          "unit": null,
          "display": "chart"
        }
      ]
    }
  ],
  "userSetting": {
    "options": [
      "exchangeName",
      "industryName",
      "eps",
      "roe",
      "pe",
      "stockRating",
      "relativeStrength3Day",
      "priceIncrease1Week",
      "priceVsSMA5",
      "foreignTransaction",
      "marketCap",
      "doe",
      "pb",
      "tcbsRecommend",
      "numIncreaseContinuousDay",
      "numDecreaseContinuousDay",
      "priceBreakOut52Week",
      "priceWashOut52Week",
      "volumeVsVSma10",
      "volumeVsVSma20",
      "beta",
      "rsi14",
      "relativeStrength1Month",
      "bollingBandSignal",
      "macdHistogram",
      "breakout"
    ],
    "defaultFilter": {
      "id": 10,
      "type": "tcbs",
      "name": {
        "vi": "Bộ lọc CANSLIM",
        "en": "CANSLIM"
      },
      "filters": [
        {
          "key": "lastQuarterProfitGrowth",
          "operator": ">=",
          "value": 25,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "epsGrowth1Year",
          "operator": ">=",
          "value": 25,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "roe",
          "operator": ">=",
          "value": 15,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "avgTradingValue20Day",
          "operator": ">=",
          "value": 10,
          "unit": null,
          "display": "chart"
        },
        {
          "key": "relativeStrength1Month",
          "operator": ">=",
          "value": 85,
          "unit": null,
          "display": "chart"
        }
      ]
    }
  }
}